{
  "Part I Field theory": [
    {
      "section": "2_Lorentz_invariance_and_second_quantization",
      "title": "Problems",
      "page_start": 46,
      "page_end": 47,
      "content": "2.1 Derive the transformations x →\nx+vt\n√\n1−v2 and t →\nt+vx\n√\n1−v2 in perturbation theory. Start\nwith the Galilean transformation x →x + vt. Add a transformation t →t + δt and\nsolve for δt assuming it is linear in x and t and preserves t2−x2 to O\n\u0006\nv2\u0007\n. Repeat for\nδt and δx to second order in v and show that the result agrees with the second-order\nexpansion of the full transformations.\n\n2.2 Special relativity and colliders.\n(a) The Large Hadron Collider was designed to collide protons together at 14 TeV\ncenter-of-mass energy. How many kilometers per hour less than the speed of light\nare the protons moving?\n(b) How fast is one proton moving with respect to the other?\n\n2.3 The GZK bound. In 1966 Greisen, Zatsepin and Kuzmin argued that we should\nnot see cosmic rays (high-energy protons hitting the atmosphere from outer space)\nabove a certain energy, due to interactions of these rays with the cosmic microwave\nbackground.\n(a) The universe is a blackbody at 2.73 K. What is the average energy of the photons\nin outer space (in electronvolts)?\n(b) How much energy would a proton (p+) need to collide with a photon (γ) in outer\nspace to convert it to a 135 MeV pion (π0)? That is, what is the energy threshold\nfor p+ + γ →p+ + π0?\n(c) How much energy does the outgoing proton have after this reaction?\nThis GZK bound was ﬁnally conﬁrmed experimentally 40 years after it was conjec-\ntured [Abbasi et al., 2008].\n\n2.4 Is the transformation Y : (t, x, y, z) →(t, x, −y, z) a Lorentz transformation? If so,\nwhy is it not considered with P and T as a discrete Lorentz transformation? If not,\nwhy not?\n\n2.5 Compton scattering. Suppose we scatter an X-ray off an electron in a crystal, but we\ncannot measure the electron’s momentum, just the reﬂected X-ray momentum.\n(a) Why is it OK to treat the electrons as free?\n(b) Calculate the frequency dependence of the reﬂected X-ray on the scattering angle.\nDraw a rough plot.\n(c) What happens to the distribution as you take the electron mass to zero?\n28\nLorentz invariance and second quantization\n(d) If you did not believe in quantized photon momenta, what kind of distribution\nmight you have expected? [Hint: see [Compton, 1923].]\n\n2.6 Lorentz invariance.\n(a) Show that\n\u0003 ∞\n−∞\ndk0δ(k2 −m2)θ(k0) =\n1\n2ωk\n,\n(2.103)\nwhere θ(x) is the unit step function and ωk ≡\n\u0015⃗k2 + m2.\n(b) Show that the integration measure d4k is Lorentz invariant.\n(c) Finally, show that\n\u0003 d3k\n2ωk\n(2.104)\nis Lorentz invariant.\n\n2.7 Coherent states of the simple harmonic oscillator.\n(a) Calculate ∂z(e−za†aeza†) where z is a complex number.\n(b) Show that |z⟩= eza†|0⟩is an eigenstate of a. What is its eigenvalue?\n(c) Calculate ⟨n|z⟩.\n(d) Show that these “coherent states” are minimally dispersive: ΔpΔq = 1\n2, where\nΔq2 = ⟨q2⟩−⟨q⟩2 and Δp2 = ⟨p2⟩−⟨p⟩2, where ⟨q⟩= ⟨z|q|z⟩\n⟨z|z⟩and ⟨p⟩= ⟨z|p|z⟩\n⟨z|z⟩.\n(e) Why can you not make an eigenstate of a†?",
      "image_path": "./figs/2_Lorentz_invariance_and_second_quantization_page_47.png"
    },
    {
      "section": "3_Classical_field_theory",
      "title": "Problems",
      "page_start": 61,
      "page_end": 64,
      "content": "3.1 Find the generalization of the Euler–Lagrange equations for general Lagrangians,\nof the form L [φ, ∂μφ, ∂ν∂μφ, . . .].\n\n3.2 Lorentz currents.\n(a) Calculate the conserved currents Kμνα associated with (global) Lorentz\ntransformations xμ →Λμνxν. Express the currents in terms of the energy-\nmomentum tensor.\n(b) Evaluate the currents for L = 1\n2φ\n\u0006\n□+ m2\u0007\nφ. Check that these currents satisfy\n∂αKμνα = 0 on the equations of motion.\n(c) What is the physical interpretation of the conserved quantities Qi =\n!\nd3xK0i0\nassociated with boosts?\n(d) Show that dQi\ndt = 0 can still be consistent with i ∂Qi\n∂t = [Qi, H]. Thus, although\nthese charges are conserved, they do not provide invariants for the equations of\nmotion. This is one way to understand why particles have spin, corresponding\nto representations of the rotation group, and not additional quantum numbers\nassociated with boosts.\nProblems\n43\n\n3.3 Ambiguities in the energy-momentum tensor.\n(a) If you add a total derivative to the Lagrangian L →L + ∂μXμ, how does the\nenergy-momentum tensor change?\n(b) Show that the total energy Q =\n!\nT00 d3x is invariant under such changes.\n(c) Show that Tμν ̸= Tνμ is not symmetric for L = −1\n4F 2\nμν. Can you ﬁnd an Xμ\nso that Tμν is symmetric in this case?\n\n3.4 Write down the next-order diagrams in Eq. (3.85) and their corresponding integral\nexpressions using Feynman rules. Check that your answer is correct by using the\nGreen’s function method.\n\n3.5 Spontaneous symmetry breaking is an important subject, to be discussed in depth in\nChapter 28. A simple classical example that demonstrates spontaneous symmetry\nbreaking is described by the Lagrangian for a scalar with a negative mass term:\nL = −1\n2φ□φ + 1\n2m2φ2 −λ\n4!φ4.\n(3.86)\n(a) How many constants c can you ﬁnd for which φ(x) = c is a solution to the\nequations of motion? Which solution has the lowest energy (the ground state)?\n(b) The Lagrangian has a symmetry under φ →−φ. Show that this symmetry\nis not respected by the ground state. We say the vacuum expectation value\nof φ is c, and write ⟨φ⟩= c. In this vacuum, the Z2 symmetry φ →−φ is\nspontaneously broken.\n(c) Write φ(x) = c+π(x) and substitute back into the Lagrangian. Show that now\nπ = 0 is a solution to the equations of motion. How does π transform under\nthe Z2 symmetry φ →−φ? Show that this is a symmetry of π’s Lagrangian.\n\n3.6 Yukawa potential.\n(a) Calculate the equations of motion for a massive vector Aμ from the Lagrangian\nL = −1\n4F 2\nμν + 1\n2m2A2\nμ −AμJμ,\n(3.87)\nwhere Fμν = ∂μAν −∂νAμ. Assuming ∂μJμ = 0, use the equations to ﬁnd a\nconstraint on Aμ.\n(b) For Jμ the current of a point charge, show that the equation of motion for A0\nreduces to\nA0(r) =\ne\n4π2ir\n\u0003 ∞\n−∞\nk dk\nk2 + m2 eikr.\n(3.88)\n(c) Evaluate this integral with contour integration to get an explicit form for A0(r).\n(d) Show that as m →0 you reproduce the Coulomb potential.\n(e) In 1935 Yukawa speculated that this potential might explain what holds protons\ntogether in the nucleus. What qualitative features does this Yukawa potential\nhave, compared to a Coulomb potential, that make it a good candidate for the\nforce between protons? What value for m might be appropriate (in MeV)?\n(f) Plug the constraint on Aμ that you found in part (a) back into the Lagrangian,\nsimplify, then rederive the equations of motion. Can you still ﬁnd the con-\nstraint? What is acting as a Lagrange multiplier in Eq. (3.87)?\n44\nClassical ﬁeld theory\n\n3.7 Nonlinear gravity as a classical ﬁeld theory. In this problem, you will calculate the\nperihelion shift of Mercury simply by dimensional analysis.\n(a) The interactions in gravity have\nL = M 2\nPl\n−1\n2hμν□hμν + (∂αhμν)(∂βhμα)hνβ + · · ·\n−hμνTμν, (3.89)\nwhere MPl =\n1\n√GN is the Planck scale. Rescaling h, and dropping indices and\nnumbers of order 1, this simpliﬁes to\nL = −1\n2h□h + (MPl)ah2□h −(MPl)bhT.\n(3.90)\nWhat are a and b (i.e. what are the dimensions of these terms)?\n(b) The equations of motion following from this Lagrangian are (roughly)\n□h = (MPl)a□(h2) −(MPl)bT.\n(3.91)\nFor a point source T = mδ(3)(x), solve Eq. (3.91) for h to second order in the\nsource T (or equivalently to third order in M −1\nPl ). You may use the Coulomb\nsolution we already derived.\n(c) To ﬁrst order, h is just the Newtonian potential. This causes Mercury to\norbit. What is Mercury’s orbital frequency, ω = 2π\nT ? How does it depend on\nmMercury, mSun, MPl and the distance R between Mercury and the Sun?\n(d) To second order, there is a correction that causes a small shift Mercury’s orbit.\nEstimate the order of magnitude of the correction to ω in arcseconds/century\nusing your second-order solution.\n(e) Estimate how big the effect is of other planets on Mercury’s orbital fre-\nquency. (Dimensional analysis will do – just get the right powers of masses\nand distances.)\n(f) Do you think the shifts from either the second-order correction or from the\nother planets should be observable for Mercury? What about for Venus?\n(g) If you derive Eq. (3.91) from Eq. (3.90), what additional terms do you get?\nWhy is it OK to use Eq. (3.91) without these terms?\n\n3.8 How does the blackbody paradox argument show that the electromagnetic ﬁeld\ncannot be classical while electrons and atoms are quantum mechanical? Should\nthe same arguments apply to treating gravity classically and electrons quantum\nmechanically?\n\n3.9 Photon polarizations (this problem follows the approach in [Feynman et al., 1996]).\n(a) Starting with L = −1\n4F 2\nμν+JμAμ, substitute in Aμ’s equations of motion. This\nis called integrating out Aμ. In momentum space, you should get something\nlike Jμ 1\nk2 Jμ.\n(b) Choose kμ = (ω, κ, 0, 0). Use current conservation (∂μJμ = 0) to formally\nsolve for J1 in terms of J0, ω and κ in this coordinate system.\n(c) Rewrite the interaction Jμ 1\nk2 Jμ in terms of J0, J2, J3, ω and κ.\n(d) In what way is a term without time derivatives instantaneous (non-causal)?\nHow many causally propagating degrees of freedom are there?",
      "image_path": "./figs/3_Classical_field_theory_page_64.png"
    },
    {
      "section": "4_Old-fashioned_perturbation_theory",
      "title": "Problems",
      "page_start": 74,
      "page_end": 74,
      "content": "4.1 Calculate the transition matrix element Tij for the process e+e−→γ →μ+μ−.\n(a) Write down the\n1\nEi−E0 terms for the two possible intermediate states, from the\ntwo possible time slicings.\n(b) Show that they add up to 2Eγ\nk2 , where kμ is now the 4-momentum of the virtual\noff-shell photon."
    },
    {
      "section": "5_Cross_sections_and_decay_rates",
      "title": "Problems",
      "page_start": 86,
      "page_end": 87,
      "content": "5.1 Show that the differential cross section for 2 →2 scattering with pμ\ni + pμ\nA →\npμ\nf + pμ\nB in the rest frame of particle A can be written as\ndσ\ndΩ =\n1\n64π2mA\nEB + Ef\n1 −|⃗pi|\n|⃗pf| cos θ\n−1 |⃗pf|\n|⃗pi| |M|2 ,\n(5.54)\nwhere θ is the angle between ⃗pi and ⃗pf, EB =\n\u0013\n(⃗pf −⃗pi)2 + m2\nB and Ef =\n\u0013\n⃗p 2\nf + m2\nf.\n\n5.2 Show that dΠLIPS is Lorentz invariant and verify Eq. (5.21).\n\n5.3 A muon decays to an electron, an electron neutrino and a muon neutrino, μ−→\ne−νμνe. The matrix element for this process, ingoring the electron and neutrino\nmasses, is given by |M|2 = 32G2\nF (m2 −2mE)mE, where m is the mass of the\nmuon and E is the energy of the outgoing νe. GF = 1.166 × 10−5 GeV−2 is the\nFermi constant.\n(a) Perform the integral over dΠLIPS to show that the decay rate is\nΓ = G2\nF m5\n192π3 .\n(5.55)\n(b) Compare your result to the observed values m = 106 MeV and τ = Γ−1 =\n2.20 μs. How big is the discrepancy as a percentage? What might account for\nthe discrepancy?\n\n5.4 Repeat the e+e−→μ+μ−calculation in Section 5.3 using circular polarizations.\n\n5.5 One of the most important scattering experiments ever was Rutherford’s gold foil\nexperiment. Rutherford scattering is αN →αN, where N is some atomic nucleus\nand α is an α-particle (helium nucleus). It is an almost identical process to Coulomb\nscattering (e−p+ →e−p+).\n(a) Look up or calculate the classical Rutherford scattering cross section. What\nassumptions go into its derivation?\n(b) We showed that the quantum mechanical cross section for Coulomb scattering\nin Eq. (5.41) follows either from the Born approximation or from quantum ﬁeld\ntheory. Start from the formula for Coulomb scattering and make the appropriate\nreplacements for αN scattering.\n(c) Draw the Feynman diagram for Rutherford scattering. What is the momentum\nof the virtual photon, kμ, in terms of the scattering angle and the energy of the\nincoming α-particle?\n68\nCross sections and decay rates\n(d) Substitute in for k4 and rewrite the cross section in terms of the kinetic energy\nof the α-particle. Show that Rutherford’s classical formula is reproduced.\n(e) Why are the classical and quantum answers the same? Could you have known\nthis ahead of time?\n(f) Would the cross section for e−e−→e−e−also be given by the Coulomb\nscattering cross section?\n\n5.6 In Section 5.3 we found that the e+e−→μ+μ−cross section had the form dσ\ndΩ =\ne4\n64π2E2\nCM (1 + cos2θ) in the center-of-mass frame.\n(a) Work out the Lorentz-invariant quantities s = (pe+ + pe−)2, t = (pμ−−pe−)2\nand\nu = (pμ+ −pe−)2\nin\nterms\nof\nECM\nand\ncos θ\n(still\nassuming\nmμ = me = 0).\n(b) Derive a relationship between s, t and u.\n(c) Rewrite dσ\ndΩ in terms of s, t and u.\n(d) Now assume mμ and me are non-zero. Derive a relationship between s, t and\nu and the masses.",
      "image_path": "./figs/5_Cross_sections_and_decay_rates_page_87.png"
    },
    {
      "section": "6_The_S-matrix_and_time-ordered_products",
      "title": "Problems",
      "page_start": 96,
      "page_end": 96,
      "content": "6.1 Calculate the Feynman propagator in position space. To get the pole structure cor-\nrect, you may ﬁnd it helpful to use Schwinger parameters (see Appendix B). Take\nthe m →0 limit of your result to ﬁnd\n⟨0|T {φ0(x1)φ0(x2)} |0⟩= −1\n4π2\n1\n(x1 −x2)2 −iε\n.\n(6.35)\n\n6.2 Find expressions for the advanced and retarded propagators as d4k integrals.\n\n6.3 Prove that any operator can be put in the form of Eq. (6.22)."
    },
    {
      "section": "7_Feynman_rules",
      "title": "Problems",
      "page_start": 122,
      "page_end": 125,
      "content": "7.1 Consider the Lagrangian for φ3 theory,\nL = −1\n2φ(□+ m2)φ + g\n3!φ3.\n(7.122)\n(a) Draw a tree-level Feynman diagram for the decay φ →φφ. Write down the\ncorresponding amplitude using the Feynman rules.\n(b) Now consider the one-loop correction, given by\nφ\nφ\nφ\n(7.123)\nWrite down the corresponding amplitude using the Feynman rules.\n(c) Now start over and write down the diagram from part (b) in position space,\nin terms of integrals over the intermediate points and Wick contractions,\nrepresented with factors of DF .\n(d) Show that after you apply LSZ, what you got in (c) reduces to what you got\nin (b), by integrating the phases into δ-functions, and integrating over those\nδ-functions.\n\n7.2 Calculate the contribution to 2 →4 scattering from the Lagrangian L = −1\n2φ□φ+\ng\n3!φ3 + 1\n6!λφ6 from both the connected diagram, with the 6-point vertex, and the\ndisconnected diagram with the 3-point vertex. Show that there is no interference\nbetween the two diagrams. (There are of course many connected diagrams with the\n3-point vertex that you can ignore.)\n\n7.3 Non-relativistic Møller scattering: e−e−→e−e−. If the electron and photon were\nspinless, we could write the Lagrangian as\nL = −1\n2φe(□+ m2\ne)φe −1\n2A0□A0 + emeA0φeφe,\n(7.124)\nwhere A0 is the scalar potential and the factor of me comes from the non-relativistic\nlimit as in Section 5.2 (or by dimensional analysis!).\n104\nFeynman rules\n(a) Draw the three tree-level e−e−\n→e−e−diagrams following from this\nLagrangian.\n(b) Which one of the diagrams would be forbidden in real QED?\n(c) Evaluate the other two diagrams, and express the answers in terms of s, t and u.\nGive the diagrams an extra relative minus sign, because electrons are fermions.\n(d) Now let us put back the spin. In the non-relativistic limit, the electron spin is\nconserved. This should be true at each vertex, since the photon is too soft to\ncarry off any spin angular momentum. Thus, a vertex can only allow for |↑⟩→\n|↑; γ⟩or |↓⟩→|↓; γ⟩. This forbids, for example, |↑↓⟩→|↑↑⟩from occurring.\nFor each of the 16 possible sets of spins for the four electrons (for example\n|↑↓⟩→|↑↑⟩), which processes are forbidden, and which get contributions from\nthe s-, t- or u-channels?\n(e) It is difﬁcult to measure electron spins. Thus, assume the beams are unpo-\nlarized, meaning that they have an equal fraction of spin-up and spin-down\nelectrons, and that you do not measure the ﬁnal electron spins, only the scat-\ntering angle θ. What is the total rate\ndσ\nd cos θ you would measure? Express the\nanswer in terms of ECM and θ. Sketch the angular distribution.\n\n7.4 We made a distinction between kinetic terms, which are bilinear in ﬁelds, and inter-\nactions, which have three or more ﬁelds. Time evolution with the kinetic terms is\nsolved exactly as part of the free Hamiltonian. Suppose, instead, we only put the\nderivative terms in the free Hamiltonian and treated the mass as an interaction. So,\nH0 = 1\n2φ□φ,\nHint = 1\n2m2φ2.\n(7.125)\n(a) Draw the (somewhat degenerate looking) Feynman graphs that contribute to\nthe 2-point function ⟨0|T{φ(x)φ(y)}|0⟩using only this interaction, up to\norder m6.\n(b) Evaluate the graphs.\n(c) Sum the series to all orders in m2 and show you reproduce the propagator that\nwould have come from taking H0 = 1\n2φ□φ + 1\n2m2φ2.\n(d) Repeat the exercise classically: Solve for the massless propagator using an\nexternal current, perturb with the mass, sum the series, and show that you get\nthe same answer as if you included the mass to begin with.\n\n7.5 Show in general that integrating by parts does not affect matrix elements.\n\n7.6 Use the Lagrangian\nL = −1\n2φ1□φ1 −1\n2φ2□φ2 + λ\n2 φ1(∂μφ2)(∂μφ2) + g\n2φ2\n1φ2\n(7.126)\nto calculate the differential cross section\ndσ\ndΩ(φ1φ2 →φ1φ2)\n(7.127)\nat tree level.\n\n7.7 Consider a Feynman diagram that looks like a regular tetrahedron, with the external\nlines coming out of the four corners. This can contribute to 2 →2 scattering in a\nscalar ﬁeld theory with interaction λ\n4!φ4. You can take φ to be massless.\nProblems\n105\n(a) Write down the corresponding amplitude including the appropriate symmetry\nfactor.\n(b) What would the symmetry factor be for the same diagram in φ3 theory without\nthe external lines?\n\n7.8 Radioactive decay. The muon decays to an electron and two neutrinos through an\nintermediate massive particle called the W −boson. The muon, electron and W −\nall have charge −1.\n(a) Write down a Lagrangian that would allow for μ−→e−¯νeνμ. Assume the W\nand other particles are all scalars, and the e−, νe and νμ are massless. Call the\ncoupling g.\n(b) Calculate |M|2 for this decay in the limit that the W mass, mW , is large.\n(c) The decay rate Γ (=\n1\nlifetime) is proportional to |M|2. The coupling g should\nbe dimensionless (like the coupling e for the photon), but appears dimension-\nful because we ignore spin. If the W spin were included, you would get extra\nfactors of pμ, which would turn into a factor of √s = mμ in |M|2. Use dimen-\nsional analysis to ﬁgure out what power of mμ should be there. Also, throw in\na\n1\n192π3 for the three-body phase space, as in Eq. (5.55) from Problem 5.3.\n(d) Pick some reasonable perturbative value for g and use the muon mass\n(mμ = 105 MeV) and lifetime (2.2 × 10−6 s) to estimate the W mass.\n(e) The tauon, τ, also decays to e−νeνμ. Use the τ lifetime Γ−1\ntot = 2.9 × 10−13 s\nand previous parts to estimate the τ mass. Which of mW , g, mμ, the muon\nlifetime, or the 192π3 we threw in does your prediction depend on?\n(f) In reality, the tauon only decays as τ →e−νeνμ 17.8% of the time. Use this\nfact to reﬁne your τ mass estimate.\n(g) How could you measure g and MW separately using very precise measure-\nments of the μ and τ decay distributions? What precision would you need\n(in %)?\n\n7.9 Unstable particles. Unstable particles pick up imaginary parts that generate a width\nΓ in their resonance line shape. This problem will develop an understanding of\nwhat is meant by the terms width and pick up.\n(a) What would the cross section be for s-channel scattering if the intermediate\npropagator were\ni\np2−m2+imΓ, where Γ > 0? This is called the Breit–Wigner\ndistribution.\n(b) Sketch the cross section as a function of x =\ns\nm2 for Γ\nm small and for Γ\nm large.\n(c) Show that a propagator only has an imaginary part if it goes on-shell. Explicitly,\nshow that Im(M) = −πδ(p2 −m2), when iM =\ni\np2−m2+iε.\n(d) Loops of particles can produce effective interactions that have imaginary parts.\nSuppose we have another particle ψ and an interaction φψψ in the Lagrangian.\nLoops of ψ will have imaginary parts if and only if ψ is lighter than half of φ,\nthat is, if φ →ψψ is allowed kinematically. Draw a series of loop corrections\nto the φ propagator. Show that, if these give an imaginary number, you can sum\nthe graphs to reproduce the propagator in part (a).\n(e) What is the connection between parts (c) and (d)? Can you see why the width\nis related to the decay rate?",
      "image_path": "./figs/7_Feynman_rules_page_125.png"
    }
  ],
  "Part II Quantum electrodynamics": [
    {
      "section": "8_Spin_1_and_gauge_invariance",
      "title": "Problems",
      "page_start": 157,
      "page_end": 158,
      "content": "8.7.3 Spin greater than 2\nOne can continue this procedure for integer spin greater than 2. There exist spin-3 particles\nin nature, for example the ω3 with mass of 1670 MeV, as well as spin 4, spin 5, etc. These\nparticles are all massive. One can construct free Lagrangians for them using the same trick.\nAn interesting and profound result is that it is impossible to have an interacting theory of\nmassless particles with spin greater than 2. The required gauge invariance would be so\nrestrictive that nothing could satisfy it. We will prove this in the next chapter. Constructing\nthe kinetic term for a spin-3 particle is done in Problem 8.8.\nProblems\n\n8.1 Show that having a probability interpretation, with 0 ≤P ≤1, requires us to have\nonly positive (or only negative) norm states.\n\n8.2 Calculate the energy-momentum tensor corresponding to the Lagrangian L =\n−1\n4F 2\nμν. Show that the energy density is positive deﬁnite, up to a total spatial\nderivative E −∂iX > 0.\n\n8.3 Calculate the classical propagator for a massive spin-1 particle by inverting the\nequations of motion to the form Aμ = ΠμνJν.\n\n8.4 Calculate the Feynman propagator for a photon. Show that Eq. (8.102) is correct.\n\n8.5 Vector polarization sums. In this problem you can build some intuition for the way\nin which the numerator of a spin-1 particle propagator represents an outer product\nof physical polarizations |ϵ⟩⟨ϵ|. Calculate the 4 × 4 matrix outer product |ϵ⟩⟨ϵ| ≡\n\u0002\nj ϵj\nμϵj\nν by the following:\n(a) Sum over the physical polarizations for a massive spin-1 particle in some\nframe. Re-express your answer in a Lorentz covariant way, in terms of m, kμkν\nand gμν.\n(b) Show that the numerator of the massive vector propagator (Problem 8.3) is the\nsame as the polarization sum. Why should this be true?\n(c) Sum over the orthonormal basis of four 4-vectors ∂μxα = δα\nμ with the\nMinkowski metric |ϵ⟩⟨ϵ |= ϵ0\nμϵ0\nν −\u00023\nj=1 ϵj\nμϵj\nν. Express your answer in a\nLorentz-covariant way.\n(d) Sum over the physical polarizations for massless vectors. Express your answer\nin a Lorentz-covariant way. You may also need the vectors kμ = (E,⃗k) and\n¯kν = (E, −⃗k).\n(e) Compare these sums to the numerator of the photon propagator, commenting\non the gauge dependence. Do either of these sums correspond to the numerator\nof one of the Rζ gauges we derived?\nProblems\n139\n\n8.6 Tensor polarization sums. A spin-2 particle can be embedded in a 2-index tensor\nhμν. Therefore, its polarizations are tensors too, ϵi\nμν. These should be orthonormal,\nϵi\nμνϵ⋆j\nμν = δij, where the sum is over μ and ν contracted with the Minkowski metric.\n(a) The polarizations should be transverse, kμϵi\nμν = 0, and symmetric, ϵi\nμν = ϵi\nνμ.\nHow many degrees of freedom do these conditions remove?\n(b) For a massive spin-2 particle, choose a frame in which the momentum kμ\nis simple. How many orthonormal ϵi\nμν can you ﬁnd? Write your basis out\nexplicitly, as 4 × 4 matrices.\n(c) Guess which of these correspond to spin 0, spin 1 or spin 2. What kind of\nLorentz-invariant condition can you impose so that you just get the spin-2\npolarizations?\n(d) If you use the same conditions but take kμ to be the momentum of a massless\ntensor, what are the polarizations? Do you get the right number?\n(e) What would you embed a massive spin-3 ﬁeld in? What conditions could you\nimpose to get the right number of degrees of freedom?\n\n8.7 Using the method of Section 8.7.2 construct the set of cubic interactions of a mass-\nless spin-2 ﬁeld embedded in hμν. There are many terms, all with two derivatives,\nbut their coefﬁcients are precisely ﬁxed. You can also check that this is the same\nthing you get from expanding M 2\nPl\n\u0013\nημν +\n1\nMPl hμνR\n\u0018\nημν +\n1\nMPl hμν\n\u0019\nto cubic\norder in hμν.\nIt should be clear that the same method will produce the terms fourth order in\nhμν, however, these are suppressed by\n1\nM 2\nPl . Most tests of general relativity probe\nonly that it is described by a minimally coupled spin-2 ﬁeld (e.g. bending of light,\ngravitational waves, frame dragging). Some precision tests assay the cubic interac-\ntions (e.g. the perihelion shift of Mercury). No experiment has yet tested the quartic\ninteractions.\n\n8.8 Construct the free kinetic Lagrangian for a massive spin-3 particle by embedding it\nin a tensor Zμνα.",
      "image_path": "./figs/8_Spin_1_and_gauge_invariance_page_158.png"
    },
    {
      "section": "9_Scalar_quantum_electrodynamics",
      "title": "Problems",
      "page_start": 174,
      "page_end": 175,
      "content": "9.1 Compton scattering in scalar QED.\n(a) Calcuate the tree-level matrix elements for (γφ →γφ). Show that the Ward\nidentity is satisﬁed.\n(b) Calculate the cross section\ndσ\nd cos θ for this process as a function of the incoming\nand outgoing polarizations, ϵin\nμ and ϵout\nμ , in the center-of-mass frame.\n(c) Evaluate\ndσ\nd cos θ for ϵin\nμ polarized in the plane of the scattering, for each ϵout\nμ .\n(d) Evaluate\ndσ\nd cos θ for ϵin\nμ polarized transverse to the plane of the scattering, for each\nϵout\nμ .\n(e) Show that when you sum (c) and (d) you get the same thing as having replaced\n(ϵin\nμ)⋆ϵin\nν with −gμν and (ϵout\nμ )⋆ϵout\nν with −gμν.\n(f) Should this replacement work for any scattering calculation?\n\n9.2 Consider the following 3-loop diagram for light-by-light scattering:\n(9.68)\n(a) Approximately how many other diagrams contribute at the same order in pertur-\nbation theory? [Hint: you do not need to draw the diagrams.]\n156\nScalar quantum electrodynamics\n(b) This diagram is not gauge invariant (independent of ξ) by itself. What is the mini-\nmal set of diagrams you need to add to this one for the sum to be gauge invariant?\nWhy should the other diagrams cancel on their own?\n\n9.3 In this problem you will prove the uniqueness of non-Abelian gauge theories by con-\nsidering the soft limit when there are multiple scalar ﬁelds φi. Suppose these ﬁelds\nhave a mass matrix M (i.e. the mass term in the Lagrangian is L = Mijφ⋆\ni φj) and\nthere are N massless spin-1 particles Aa\nμ, a = 1 . . . N we will call gluons. Then the\ngeneric interaction between Aa\nμ, φi and φj can be written as Γaμ\nij (p, q) as in Eq. (9.57).\n(a) Show that in the soft limit, q ≪p, the charges are now described by a matrix\nT a = T a\nij.\n(b) For N = 1, show that only if [M, T] = 0 can the theory be consistent. Conclude\nthat gluons (or the photon) can only couple between particles of the same mass.\n(c) Consider Compton scattering, φi(p)Aa\nμ(qa) →φj(p′)Ab\nν(qb), in the soft limit\nqa, qb ≪p, p′. Evaluate the two diagrams for this process and then show that,\nby setting ϵa\nμ = qa\nμ and ϵb\nν = qb\nν, the interactions are consistent with Lorentz\ninvariance only if\n\u0004\nT a, T b\u0005\n= 0, assuming nothing else is added.\n(d) Show that one can modify this theory with a contact interaction involving\nφiφjAa\nμAb\nν of the generic form Γabμν\nij\n\u0006\np, qa, qb\u0007\nso that Lorentz invariance is pre-\nserved in the soft limit. How must Γabμν\nij\nrelate to T a\nij? Show also that Γabμν\nij\nmust\nhave a pole, for example as (qa + qb)2 →0.\n(e) Such a pole indicates a massless particle being exchanged, naturally identiﬁed\nas a gluon. In this case, the Γabμν\nij\ninteraction in part (d) can be resolved into a\n3-point interaction among gluons, of the form Γabc\nμνα\n\u0006\nqa, qb, qc\u0007\nand the Γaμ\nij (p, q)\nvertex. Show that if Γabc\nμνα itself has no poles, then in the soft limit it can be written\nuniquely as Γabc\nμνα\n\u0006\nqa, qb, qc\u0007\n= f abc(gμνqα\nc + · · · ) for some constants f abc and\nwork out the · · · . Show that if and only [T a, T b] = if abcT c can the Compton\nscattering amplitude be Lorentz invariant in the soft limit. This implies that the\ngluons transform in the adjoint representation of a Lie group, as will be discussed\nin Chapter 25.\n\n9.4 The soft limit also implies that massless spin-2 particles (gravitons) must have self-\ninteractions.\n(a) To warm up, consider the soft limit of massless spin-1 particles coupled to\nscalars (as in scalar QED). Just assuming generic interactions (not the scalar\nQED Lagrangian), show that there must be an AAφ⋆φ interaction for Compton\nscattering to be Lorentz invariant.\n(b) Now consider Compton scattering of gravitons h off scalars. Show that there must\nbe an hhφφ interaction. Then show that unlike the massless spin-1 case the new\ninteraction must have a pole at (q1 + q2)2 = 0. This pole should be resolved into\na graviton exchange graph. Derive a relationship between the form of the graviton\nself-coupling and the hφφ coupling.",
      "image_path": "./figs/9_Scalar_quantum_electrodynamics_page_175.png"
    },
    {
      "section": "10_Spinors",
      "title": "Problems",
      "page_start": 200,
      "page_end": 202,
      "content": "10.1 We saw that the Dirac equation predicted that there is interaction between the elec-\ntron spin and the magnetic ﬁeld, ⃗S ⃗B, with strength μB =\nℏc\n2me . When the electron\nhas angular momentum ⃗L, such as in an atomic orbital, there is also a ⃗B⃗L interaction\nand a spin-orbit coupling ⃗S⃗L. The Dirac equation (along with symmetry arguments)\npredicts the strength of all three interactions, as well as other corrections. To see the\neffect of these terms on the hydrogen atom, we have to take the non-relativistic limit.\n(a) For the Schr¨odinger equation, we need the Hamiltonian, not the Lagrangian.\nFind the Dirac Hamiltonian by writing the Dirac equation as i∂tψ = HDψ.\nWrite the Hamiltonian in terms of momenta pi rather than derivatives ∂i.\n(b) Calculate (HD + eA0)2 in the Weyl representation for ψ = (ψLψR). Leave in\nterms of σi, pi and Ai. Put back in the factors of c and ℏ, keeping the charge e\ndimensionless.\n(c) Now take the square root of this result and expand in 1\nc, subtracting off the zero-\npoint energy mc2, i.e. compute H = HD −mc2 to order c0. Looking at the σi\nterm, how big are the electron’s electric and magnetic dipole moments?\n(d) The size of the terms in this Hamiltonian are only meaningful because the spin\nand angular momentum operators have the same normalization. Check the nor-\nmalization of the angular momentum operators Li = εijkxjpk and the spin\noperators Si =\n1\n2σi\nby showing that they both satisfy the rotation algebra:\n[Ji, Jj] = iεijkJk.\n(e) The gyromagnetic ratio, ge (sometimes called the g-factor), is the relative size\nof the ⃗S ⃗B and ⃗L ⃗B interactions. Choose a constant magnetic ﬁeld in the z direc-\ntion, then isolate the BzLz coupling in H. Extract the electron gyromagnetic\nratio ge by writing the entire coupling to the magnetic ﬁeld in the Hamilto-\nnian as μBBz(Lz + geSz) = Bzμz, with ⃗μ ≡μB(⃗L + ge⃗S). How could you\nexperimentally measure ge (e.g. with spectroscopy of the hydrogen atom)?\n(f) In spherical coordinates, the Schr¨odinger equation has a ⃗L2 term. With spin,\nyou might expect that this becomes ⃗L⃗μ = μB(⃗L2 +ge⃗L⃗S), making the ⃗L⃗S term\nproportional to the g-factor. This is wrong. It misses an important relativistic\neffect, Thomas precession. It is very hard to calculate directly, but easy to calcu-\nlate using symmetries. With no magnetic ﬁeld, the atom, with spin included, is\nstill rotationally invariant. Which of ⃗J = ⃗L + ⃗S or ⃗μ = ⃗L + ge⃗S is conserved\n182\nSpinors\n(i.e. commutes with ⃗H)? Using this result, how does the spin-orbit coupling\ndepend on ge?\n(g) There are additional relativistic effects coming from the Dirac equation. Expand\nthe Dirac equation to next order in 1\nc2 , producing a term that scales as ⃗p4.\n(h) Now let us do some dimensional analysis – there is only one scale me. Show that\nthe electron’s Compton wavelength, the classical electron radius, re, the Bohr\nradius, a0, and the inverse-Rydberg constant, Ry−1, are all me times powers of\nαe. Are the splittings due to the p4 term ﬁne structure (ΔE ∼α2\neE), hyperﬁne\nstructure (ΔE ∼α4\neE) or something else? [Hint: write out a formula for the\nenergy shift using time-dependent perturbation theory, then see which of the\nabove length scales appears.]\n\n10.2 In this problem you will construct the ﬁnite-dimensional irreducible representations\nof SU(2). By deﬁnition, such a representation is a set of three n × n matrices τ1, τ2\nand τ3 satisfying the algebra of the Pauli matrices [τi, τj] = iεijkτk. It is also helpful\nto deﬁne the linear combinations τ ± = τ 1 ± iτ 2.\n(a) In any such representation we can diagonalize τ3. Its eigenvectors are n complex\nvectors Vj with τ3Vj = λjVj. Show that τ +Vj and τ −Vj either vanish or are\neigenstates of τ3 with eigenvalues λj + 1 and λj −1 respectively.\n(b) Prove that exactly one of the eigenstates Vmax of τ3 must satisfy τ +Vmax = 0.\nThe eigenvalue λmax = j of Vmax is known as the spin. Similarly, there will be\nan eigenvector Vmin of τ3 with τ −Vmin = 0.\n(c) Since there are a ﬁnite number of eigenvectors, Vmin = (τ −)N Vmax for some\ninteger N. Prove that N = 2J so that n = 2J + 1.\n(d) Construct explicitly the ﬁve-dimensional representation of SU(2).\n\n10.3 Derive Eqs. (10.141) and (10.142):\n(a) gμνσα ˙α\nμ σβ ˙β\nν\n= 2εαβε ˙α ˙β,\n(b) εαβε ˙α ˙βσμβ ˙β = ¯σμ\n˙αα.\n\n10.4 Majorana representation.\n(a) Write out the form of the Lorentz generators in the Majorana representation.\n(b) Compute ⃗J2 in the Majorana representation, the left-handed Weyl representation\nand 4-vector representation. How do you interpret the eigenvalues of ⃗J2?\n(c) Calculate γ5 = iγ0γ1γ2γ3 in the Majorana representation.\n\n10.5 Supersymmetry.\n(a) Show that the Lagrangian\nL = ∂μφ⋆∂μφ + χ†i¯σ∂χ + F ⋆F + mφF + i\n2mχT σ2χ + h.c.\n(10.143)\nis invariant under\nδφ = −iεT σ2χ,\n(10.144)\nδχ = ϵF + σμ∂μφσ2ϵ⋆,\n(10.145)\nδF = −iϵ†¯σμ∂μχ,\n(10.146)\nwhere ϵ is an inﬁnitesimal spinor, χ is a spinor, and F and φ are scalars. All\nspinors anticommute. σ2 is the second Pauli spin matrix.\nProblems\n183\n(b) The ﬁeld F is an auxiliary ﬁeld, since it has no kinetic term. A useful trick for\ndealing with auxiliary ﬁelds is to solve their equations of motion exactly and\nplug the result back into the Lagrangian. This is called integrating out a ﬁeld.\nIntegrate out F to show that φ and χ have the same mass.\n(c) Auxiliary ﬁelds such as F act like Lagrange multipliers. One reason to keep the\nauxiliary ﬁelds in the Lagrangian is because they make symmetry transforma-\ntions exact at the level of the Lagrangian. After the ﬁeld has been integrated\nout, the symmetries are only guaranteed to hold if you use the equations of\nmotion. Still using δφ = iεT σ2χ, what is the transformation of χ that makes the\nLagrangian in (b) invariant, if you are allowed to use the equations of motion?",
      "image_path": "./figs/10_Spinors_page_202.png"
    },
    {
      "section": "11_Spinor_solutions_and_CPT",
      "title": "Problems",
      "page_start": 220,
      "page_end": 223,
      "content": "11.1 In practice, we only rarely use explicit representations of the Dirac matrices. Most\ncalculations can be done using algebraic identities that depend only on {γμ, γν} =\n2gμν. Derive algebraically (without using an explicit representation):\n(a) (γ5)2 = 1\n(b) γμ/pγμ = −2/p\n(c) γμ/p/q/pγμ = −2/p/q/p\n(d)\n+\nγ5, γμ,\n= 0\n(e) Tr[γαγμγβγν] = 4(gαμgβν −gαβgμν + gανgμβ)\n\n11.2 Spinor identities.\n(a) Show that \u0002\nsus(p)¯us(p) = /p + m and \u0002\nsvs(p)¯vs(p) = /p −m.\n(b) Show that ¯uσ(p)γμuσ′(p) = 2δσσ′pμ.\n\n11.3 Prove that massless spin-1 particles coupled to spin-0 or spin- 1\n2 particles imply a\nconserved charge. You may use results from Section 9.5.\n\n11.4 Show that for on-shell spinors\n¯u(q)γμu(p) = ¯u(q)\nqμ + pμ\n2m\n+ iσμν(qν −pν)\n2m\nu(p),\n(11.92)\n202\nSpinor solutions and CPT\nwhere σμν =\ni\n2[γμ, γν]. This is known as the Gordon identity. We will use this\nwhen we calculate the 1-loop correction to the electron’s magnetic dipole moment.\nShow that ¯uσ(p)γμuσ′ (p) = −iδσσ′ pμ\np0 .\n\n11.5 Derive the charge-conjugation properties of the spinor bilinears in Eqs. (11.54) to\n(11.56).\n\n11.6 The physics of spin and helicity.\n(a) Use the left and right helicity projection operators to show that the QED vertex\n¯ψhγμψh′ vanishes unless h = h′.\n(b) For the non-relativistic limit, choose explicit spinors for a spinor at rest. Show\nthat ¯ψsγμψs′ vanishes unless s = s′.\n(c) Use the Schr¨odinger equation to show that in the non-relativistic limit the\nelectric ﬁeld cannot ﬂip an electron’s spin, only the magnetic ﬁeld can.\n(d) Suppose we take a spin-up electron going in the +z direction, and turn it around\ncarefully with electric ﬁelds so that now it goes in the −z direction but is still\nspin up. Then its helicity ﬂipped. Since all interactions between electrons and\nphotons preserve helicity, how can this have happened?\n(e) How can you measure the spin of a slow electron?\n(f) Suppose you have a radioactive source, such as cobalt-60, which undergoes β-\ndecay 60\n27Co →60\n28 Ni + e−+ ¯ν. How could you (in principle) ﬁnd out if those\nelectrons coming out are polarized; that is, if they all have the same helicity?\nDo you think they would be polarized? If so, which polarization do you expect\nmore of?\n\n11.7 Show that the most general Lagrangian term you can write down in terms of Dirac\nspinors, γ-matrices, and the photon ﬁeld Aμ is automatically invariant under CPT.\nTo warm up, consider ﬁrst the terms in Eq. (11.91).\n\n11.8 Fierz rearrangement formulas (Fierz identities). It is often useful to rewrite spinor\ncontractions in other forms to simplify formulas. Show that\n(a)\n\u0006 ¯ψ1γμPLψ2\n\u0007 \u0006 ¯ψ3γμPLψ4\n\u0007\n= −\n\u0006 ¯ψ1γμPLψ4\n\u0007 \u0006 ¯ψ3γμPLψ2\n\u0007\n(b)\n\u0006 ¯ψ1γμγαγβPLψ2\n\u0007 \u0006 ¯ψ3γμγαγβPLψ4\n\u0007\n= −16\n\u0006 ¯ψ1γμPLψ4\n\u0007 \u0006 ¯ψ3γμPLψ2\n\u0007\n(c) Tr\n\u0004\nΓMΓN\u0005\n= 4δMN, with ΓM ∈{1, γμ, σμν, γ5γμ, γ5}\n(d)\n\u0006 ¯ψ1ΓMψ2\n\u0007 \u0006 ¯ψ3ΓNψ4\n\u0007\n= \u0002\nP Q\n1\n16Tr\n\u0004\nΓP ΓMΓQΓN\u0005 \u0006 ¯ψ1ΓP ψ4\n\u0007 \u0006 ¯ψ3ΓQψ2\n\u0007\nwhere PL = 1−γ5\n2\nprojects out the left-handed spinor from a Dirac fermion. The\nidentities with PL play an important role in the theory of weak interactions, which\nonly involves left-handed spinors (see Chapter 29).\n\n11.9 The electron neutrino is a nearly massless neutral particle. Its interactions violate\nparity: only the left-handed neutrino couples to the W and Z bosons.\n(a) The Z is a vector boson, like the photon but heavier, and has an associated U(1)\ngauge invariance (it is actually broken in nature, but that is not relevant for this\nproblem). If there is only a left-handed neutrino νL, the only possible mass\nterm of dimension four is a Majorana mass, of the form iMνT\nLσ2νL. Show that\nthis mass is forbidden by the U(1) symmetry.\nThis motivates the introduction of a right-handed neutrino νR. The most\ngeneral kinetic Lagrangian involving νL and νR is\nProblems\n203\nLkin = ν†\nL¯σμ∂μνL + ν†\nRσμ∂μνR + m(ν†\nLνR + ν†\nRνL)\n+ iM\n\u0016\nνT\nRσ2νR −ν†\nRσ2ν⋆\nR\n\u0017\n,\n(11.93)\nwhere νL is a left-handed ( 1\n2, 0) two-component Weyl spinor and νR is a right-\nhanded (0, 1\n2) Weyl spinor. Note that there are two mass terms: a Dirac mass\nm, as for the electron, and a Majorana mass, M.\n(b) We want to ﬁgure out what the mass eigenstates are, but as written the\nLagrangian is mixing everything up. First, show that χL ≡iσ2ν⋆\nR transforms\nas a left-handed spinor under the Lorentz group, so that it can mix with νL.\nThen rewrite the mass terms in terms of νL and χL.\n(c) Next, rewrite the Lagrangian in terms of a doublet ⃗Θ ≡(νL, χL). This is not a\nDirac spinor, but a doublet of left-handed Weyl spinors. Using Lkin, show that\nthis doublet satisﬁes the Klein–Gordon equation. What are the mass eigenstates\nfor the neutrinos? How many particles are there?\n(d) Suppose M ≫m. For example, M = 1010 GeV and m = 100 GeV. What are\nthe masses of the physical particles? The fact that as M goes up, the physical\nmasses go down, inspired the name see-saw mechanism for this neutrino mass\narrangement. What other choice of M and m would give the same spectrum of\nobserved particles (i.e. particles less than ∼1 TeV)?\n(e) The left-handed neutrino couples to the Z boson and also to the electron\nthrough the W boson. The W boson also couples the neutron and proton. The\nrelevant part for the weak-force Lagrangian is\nLweak = gW(ν†\nL /WeL+e†\nL /WνL)+gZ(ν†\nL /ZνL)+gW (n /W ¯p+¯n /Wp). (11.94)\nUsing these interactions, draw a Feynman diagram for neutrinoless double β-\ndecay, in which two neutrons decay to two protons and two electrons.\n(f) Which of the terms in Lkin and Lweak respect a global symmetry (lepton num-\nber) under which νL →eiθνL, νR →eiθνR and eL →eiθeL? Deﬁne\narrows on the e and ν lines to respect lepton number ﬂow. Show that you\ncannot connect the arrows on your diagram without violating lepton number.\nDoes this imply that neutrinoless double β-decay can tell if the neutrino has a\nMajorana mass?\n\n11.10 In Section 10.4, we showed that the electron has a magnetic dipole moment,\nof order μB =\ne\n2me , by squaring the Dirac equation. An additional magnetic\nmoment could come from an interaction of the form B = iFμν ¯ψ[γμ, γν]ψ in the\nLagrangian. An electric dipole moment (EDM) corresponds to a term of the form\nE = Fμν ¯ψγ5[γμ, γν]ψ.\n(a) Expand the contribution of the electric dipole term to the Dirac equation\nin terms of electric and magnetic ﬁelds to show that it does in fact give\nan EDM.\n(b) Which of the symmetries C, P or T are respected by the magnetic dipole\nmoment operator, B, and the EDM operator, E?",
      "image_path": "./figs/11_Spinor_solutions_and_CPT_page_223.png"
    },
    {
      "section": "12_Spin_and_statistics",
      "title": "Problems",
      "page_start": 242,
      "page_end": 242,
      "content": "12.1 In a causal theory, commutators of observables should vanish outside the light-\ncone, [φ(x), φ(y)] = 0 for (x −y)2 < 0. For spinors, we found that with\nanticommutation relations\n+ ¯ψ(x), ψ(y)\n,\n= 0 outside the lightcone. This implies\nthat integer spin quantities constructed out of spinors are automatically causal,\ne.g.\n\u0004 ¯ψψ(x), ¯ψψ(y)\n\u0005\n= 0. However, this is not a proof that spinors must anti-\ncommute. What would happen to\n\u0004 ¯ψψ(x), ¯ψψ(y)\n\u0005\noutside the lightcone if we\nused commutation relations for spinors? For simplicity, you can just look at\n0|\n\u0004 ¯ψψ(x), ¯ψψ(y)\n\u0005\n|0\n\b\n."
    },
    {
      "section": "13_Quantum_electrodynamics",
      "title": "Problems",
      "page_start": 267,
      "page_end": 269,
      "content": "13.1 Of the tree-level processes in QED, Møller scattering (e−e−→e−e−) is especially\ninteresting because it involves identical particles.\n(a) Calculate the spin-averaged differential cross section for Møller scattering,\ne−e−→e−e−. Express your answer in terms of s, t, u and me.\n(b) Show that in the non-relativistic limit you get what we guessed by spin-\nconservation arguments in Problem 7.3:\ndσ\ndΩ = m4\neα2\nE2\nCMp4\n1 + 3 cos2θ\nsin4θ\n,\np2 =\nECM\n2\n2\n−m2\ne.\n(13.162)\n(c) Simplify the Møller scattering formula in the ultra-relativistic limit (me →0).\n[Hint: you should get something proportional to (3 + cos2θ)2.]\n\n13.2 Derive Eq. (13.103). It may be helpful to use the formula for scattering in the target\nrest frame derived in Problem 5.1.\n\n13.3 Particle decays. Recall that the decay rate is given by the general formula\ndΓ =\n1\n2E1\n|M|2 d3p2\n(2π)3\n1\n2E2\n· · · d3pn\n(2π)3\n1\n2En\n(2π)4δ4(p1 −p2 −· · · −pn). (13.163)\n(a) Evaluate the phase-space integrals for 1 →2 decays. Show that the total rate is\nΓ(φ →e+ + e−) =\n√\n1 −4x2\n8πmφ\n|M|2,\nx = me\nmφ\n.\n(13.164)\n(b) Evaluate Γ for a particle φ of mass mφ decaying to e+e−of mass me if\n1. φ is a scalar, with interaction gSφ ¯ψψ;\n2. φ is a pseudoscalar, with interaction igP φ ¯ψγ5ψ;\n3. φ is a vector, with interaction gV φμ ¯ψγμψ;\n4. φ is an axial vector, with interaction igAφμ ¯ψγμγ5ψ.\n(c) Breaking news! A collider experiment reports evidence of a new particle that\ndecays only to leptons (τ, μ and e) whose mass is around 4 GeV. About 25% of\nthe time it decays to τ +τ −. What spin and parity might this particle have?\n\n13.4 Show that you always get a factor of −1 in the Feynman rules for each fermionic\nloop.\n\n13.5 Consider the following diagram for e+e−→μ+μ−in QED:\n(a) How many diagrams contribute at the same order in perturbation theory?\nProblems\n249\n−1.0\n−0.5\n0.0\n0.5\n1.0\n0\n100\n200\n300\n400\n500\n600\ncos θ\nEvents\n−1.0\n−0.5\n0.0\n0.5\n1.0\n0\n100\n200\n300\n400\n500\n600\ncos θ\nEvents\ne+ e− → μ+ μ−\ne+ e− → νμνμ\n−\nAngular distributions in e+e−annihilation produced with a Monte-Carlo simulation.\nt\nFig. 13.2\n(b) What is the minimal set of diagrams you need to add to this one for the sum to\nbe gauge invariant (independent of ξ)?\n(c) Show explicitly that the sum of diagrams in part (b) is gauge invariant.\n\n13.6 Parity violation. We calculated that e+e−→μ+μ−has a 1 + cos2θ angular depen-\ndence (see Eq. (13.78)), where θ is the angle between the e−and μ−directions.\nThis agrees with experiment, as the simulated data on the left side of Figure 13.2\nshow. The angular distribution for scattering into muon neutrinos, e+e−→νμ¯νμ, is\nvery different, as shown on the right side of Figure 13.2, where now θ is the angle\nbetween the e−and νμ directions.\n(a) At low energy, the total cross section, σtot, for e+e−→νμ¯νμ scattering grows\nwith energy, in contrast to the total e+e−→μ+μ−cross section. Show that this\nis consistent with neutrino scattering being mediated by a massive vector boson,\nthe Z. Deduce how σtot should depend on ECM for the two processes.\n(b) Place the neutrino in a Dirac spinor ψν. There are two possible cou-\nplings we could write down for the ν to the new massive gauge boson:\ngV ¯ψν /Zψν + gA ¯ψν /Zγ5ψν. These are called vector and axial-vector couplings,\nrespectively. Assume the Z couples to the electron in the same way as it cou-\nples to neutrinos. Calculate the full angular dependence for e+e−→νμ¯νμ as a\nfunction of gV and gA (you can drop masses).\n(c) What values of gV and gA reproduce Figure 13.2? Show that this choice is equiv-\nalent to the Z boson having chiral couplings: it only interacts with left-handed\nﬁelds. Argue that this is evidence of parity violation, where the parity operator\nP is reﬂection in a mirror: ⃗x →−⃗x.\n(d) An easier way to see parity violation is in β-decay. This is mediated by charged\ngauge bosons, the W ±, that are “uniﬁed” with the Z. Assuming they have the\nsame chiral couplings as the Z, draw a diagram to show that the electron coming\nout of C60 →Ni59 +e−+ ¯ν will always be left-handed, independent of the spin\nof the cobalt nucleus. What handedness would the positron be in anti-cobalt\ndecay: C\n60 →Ni\n59 + e+ + ν?\n(e) If you are talking to aliens on the telephone (i.e. with light only), tell them how\nto use nuclear β-decay to tell clockwise from counterclockwise. For this, you\nwill need to ﬁgure out how to relate the L in ψL to “left” in the real world.\n250\nQuantum electrodynamics\nYou are allowed to assume that all the materials on Earth are available to them,\nincluding things such as cobalt, and lasers.\n(f) If you meet those aliens, and put out your right hand to greet them, but they put\nout their left hand, why should you not shake? (This scenario is due to Feynman.)\n(g) Now forget about neutrinos. Could you have the aliens distinguish right from left\nby actually sending them circularly polarized light, for example using polarized\nradio waves for your intergalactic telephone?\n\n13.7 One should be very careful with polarization sums and in giving physical inter-\npretations to individual Feynman diagrams. This problem illustrates some of the\ndangers.\n(a) We saw that the t-channel diagram for Compton scattering scales as Mt ∼\n1\nt . Calculate |Mt|2 summed over spins and polarizations. Be sure to sum over\nphysical transverse polarizations only.\n(b) Calculate |Mt|2 summed over spins and polarizations, but do the sum by replac-\ning ϵμϵ⋆\nν by −gμν. Show that you get a different answer from part (a). Why is\nthe answer different?\n(c) Show that when you sum over all the diagrams you get the same answer whether\nyou sum over physical polarizations or use the ϵμϵ⋆\nν →−gμν replacement. Why\nis the answer the same?\n(d) Repeat this exercise for scalar QED.",
      "image_path": "./figs/13_Quantum_electrodynamics_page_269.png"
    },
    {
      "section": "14_Path_integrals",
      "title": "Problems",
      "page_start": 302,
      "page_end": 303,
      "content": "14.8.4 Gauge invariance\nAnother consequence of the proof of the Ward identity in the previous section is that it\nlets us also prove gauge invariance in the sense of independence of the covariant gauge\nparameter ξ. Consider an arbitrary S-matrix element involving b external photons and f\nexternal fermions at order en in perturbation theory. All the diagrams contributing at this\norder will involve the same number of internal photons, namely m =\nb−n\n2 , since each\nexternal photon gives one factor of e and each internal photon gives two factors of e. Thus,\nthe amplitude can be written as a sum over m propagators:\nM = enϵαb\n1 · · · ϵαb\nb\n\u0003\nd4k1 · · · d4kmΠμ1ν1(k1) · · · Πμmνm(km)\n× Mμ1ν1···μmνmα1···αn(· · · ki · · · qi) ,\n(14.156)\nwhere qi are all the external momenta and ϵαi\ni\nthe external photon polarizations. Here\nMμ1···on the right-hand side can be written as an integral over matrix elements of time-\nordered products of currents and evaluated at e = 0, that is, in the free theory.\nBy the Ward identity, which we saw does not require the photons to have p2 = 0,\npμ1Mμ1··· = 0. Thus, if we replace any of the photon propagators by\nΠμν(k) →Πμν(k) + ξkμkν,\n(14.157)\nthe correction will vanish. Therefore, the matrix element is independent of ξ. This proof\nrequires the external fermions to be on-shell, since otherwise there are contact interactions\nthat give additional matrix elements on the right-hand side. It does not require the external\nphotons to be on-shell.\nProblems\n\n14.1 Show that for complex scalar ﬁelds\n\u0003\nDφ⋆Dφ exp\ni\n\u0003\nd4x(φ⋆Mφ + JM)\n= N\n1\ndet M exp(iJM −1J)\n(14.158)\nfor some (inﬁnite) constant N.\n\n14.2 Furry’s theorem states that ⟨Ω |T{Aμ1(q1) · · · Aμn(qn)}| Ω⟩= 0 if n is odd. It is a\nconsequence of charge-conjugation C invariance.\n(a) In scalar QED, charge conjugation swaps φ and φ⋆. How must Aμ transform so\nthat the Lagrangian is invariant?\n(b) Prove Furry’s theorem in scalar QED non-perturbatively using the path integral.\n(c) Does Furry’s theorem hold if the photons are off-shell or just on-shell?\n(d) Prove Furry’s theorem in QED.\n284\nPath integrals\n(e) In the Standard Model, charge conjugation is violated by the weak interactions.\nDoes your proof, for correlation functions of photons, still work in the Standard\nModel, or do you expect small violations of Furry’s theorem?\n\n14.3 In this problem, you will calculate ⟨Φ|0⟩to verify Eqs. (14.65) and (14.66).\n(a) Invert the expansion of free ﬁelds in creation and annihilation operators\n(Eq. (2.78)) to solve for ap in terms of ˆφ(x) and ˆπ(x) = ∂t ˆφ(x).\n(b) Show that ˆπ acts on eigenstates of ˆφ as the variational derivative −i δ\nδφ.\n(c) Write a differential equation for ⟨Φ|0⟩using ap|0⟩= 0.\n(d) Show that the solution is given by ⟨Φ|0⟩in Eqs. (14.65) and (14.66).\n(e) Find a closed form for E(⃗x, ⃗y) in the massive and massless cases.\n\n14.4 In this problem, you will construct all the states that satisfy Eq. (14.19), ˆφ(⃗x)|Φ⟩=\nΦ(⃗x)|Φ⟩, explicity. This is one way to deﬁne the measure on the path integral.\n(a) Write the eigenstates of ˆx = c\n\u0006\na + a†\u0007\nfor a single harmonic oscillator in terms\nof creation operators acting on the vacuum. That is, ﬁnd fz\n\u0006\na†\u0007\nsuch that ˆx|ψ⟩=\nz|ψ⟩, where |ψ⟩= fz\n\u0006\na†\u0007\n|0⟩.\n(b) Generalize the above construction to ﬁeld theory, to ﬁnd the eigenstates |Φ⟩of\nˆφ(⃗x) that satisfy ˆφ(⃗x)|Φ⟩= Φ(⃗x)|Φ⟩.\n(c) Prove that these eigenstates satisfy the orthogonality relation Eq. (14.22).\n\n14.5 Schwinger terms.\n(a) What are the Schwinger–Dyson equations for photons and charged scalar ﬁelds\nin scalar QED? That is, give an equation for □μν⟨AνAαφ⋆φ⟩= ?\n(b) How is the current-conservation Schwinger–Dyson equation different in QED\nand scalar QED?\n\n14.6 Anticommutation.\n(a) Since Grassmann numbers anticommute, θ1θ2θ1θ2 = 0, why does a term in the\nLagrangian such as ¯ψ(x)ψ(x) ¯ψ(x)ψ(x) not automatically vanish? What about\n( ¯ψψ)5? Would you get the same answer for e+e−→4e+e−pairs from a ( ¯ψψ)5\nterm in the Lagrangian in the canonical formalism and with the path integral?\n(b) We showed that correlation functions of gauge-invariant operators come out the\nsame if we add a term −1\n2ξ(∂μAμ)2 to the Lagrangian. Would they come out\nthe same if we added a term of the form −1\n2ξ(∂μAμ)4? What about a term of the\nform ξA2\nμ?\n\n14.7 To derive the Schwinger–Dyson equations for scalars in the canonical picture,\nwe needed to use the equations\n\u0006\n□+ m2\u0007ˆφ = L′\nint[ˆφ] and [ˆφ(⃗x, t), ∂t ˆφ(⃗y, t)] =\niδ3(⃗x −⃗y):\n(a) What is the equivalent of these equations for Dirac spinors?\n(b) Verify the Schwinger–Dyson equation in Eq. (14.127) using the canonical\napproach.\n(c) Verify the Schwinger–Dyson equation in Eq. (14.127) using the path integral.",
      "image_path": "./figs/14_Path_integrals_page_303.png"
    }
  ],
  "Part III Renormalization": [
    {
      "section": "15_The_Casimir_effect",
      "title": "Problems",
      "page_start": 318,
      "page_end": 318,
      "content": "15.4.2 Interpretation of counterterms\nAnother way of getting the same result is to add a counterterm to the Lagrangian. That\nmeans adding another interaction that is just like the ﬁrst, but inﬁnite. So we take as our\nLagrangian\nL = −1\n2φ□φ −λR\n4! φ4 −δλ\n4! φ4,\n(15.70)\nwhere the counterterm δλ is inﬁnite, but formally of order λ2\nR. Then, working to order λ2\nR,\nthe amplitude is\nM(s) = −λR −δλ −λ2\nR\n32π2 ln s\nΛ2 + O(λ4\nR).\n(15.71)\nNow we can choose δλ to be whatever we want. If we take it to be\nδλ = −λ2\nR\n32π2 ln s0\nΛ2 ,\n(15.72)\nthen\nM(s) = −λR + λ2\nR\n32π2 ln s\ns0\n,\n(15.73)\nwhich is ﬁnite. In particular, this choice of δλ makes M(s0) = −λR, which was our\ndeﬁnition of λR above.\nDoing things this way, with counterterms but as a perturbative expansion in the physical\ncoupling λR, is known as renormalized perturbation theory. The previous way, where we\ncompute physical quantities such as M(s1)−M(s2) directly, is sometimes called physical\nor on-shell perturbation theory. The two are equivalent, but for complicated calculations,\nrenormalized perturbation theory is often much easier.\nProblems\n\n15.1 Evaluate the Casimir force using the Gaussian regulator in Eq. (15.29).\n\n15.2 Show that the Casimir force from the vacuum energy of fermions has the opposite\nsign than from bosons.\n\n15.3 It has been proposed that geckos use the Casimir force to climb walls. It is known\nthat geckos do not use suction (like salamanders) or capillary adhesion (like some\nfrogs). A gecko’s foot is covered in a million tiny hairs called setae, which terminate\nin spatula-shaped structures around 0.5 µm wide. Use dimensional analysis and the\nform of the Casimir force to decide whether you think this could be possible.\n\n15.4 The vacuum energy of massive particles also contributes to the Casimir force. Before\ndoing the calculation, how do you expect the Casimir force to depend on mass? Now\ndo the calculation and see if you are correct (use any approximations you want – this\nproblem is challenging)."
    },
    {
      "section": "16_Vacuum_polarization",
      "title": "Problems",
      "page_start": 333,
      "page_end": 333,
      "content": "16.1 Calculate the pμpν pieces of the vacuum polarization graph in scalar QED and in\nspinor QED. Show that your result is consistent with the Ward identity.\n\n16.2 Calculate the Uehling potential, Eq. (16.60), by Fourier transforming the effective\npotential.\n\n16.3 The pions, π±, are charged scalar quark–antiquark bound states (mesons) with\nmasses of 139 MeV. The tauon is a lepton with mass 1770 MeV. Consider the con-\ntribution of the vacuum polarization amplitude to π+π−→π+π−through a virtual\nτ loop in QED. For simplicity, consider the s-channel contribution only.\n(a) Plot |M|2 as a function of s for forward scattering (t = 0). You should ﬁnd a\nkink at s = s0. What is s0? What is going on physically when s > s0?\n(b) Plot the real and imaginary parts of M separately. Calculate Im(M) explicitly\nand show that it agrees with your plot.\n(c) Find a relationship between Im(M) at t = 0 and the total rate for π+π−→\ne+e−. This is a special case of a general and powerful result known as the optical\ntheorem, which is discussed in detail in Chapter 24.\n\n16.4 Where is the location of the Landau pole in QED if you include contributions from\nthe electron, muon and tauon (all with charge Q = −1), from nine quarks (three\ncolors times three ﬂavors) with charge Q =\n2\n3 and from nine quarks with charge\nQ = −1\n3?"
    },
    {
      "section": "17_The_anomalous_magnetic_moment",
      "title": "Problems",
      "page_start": 340,
      "page_end": 340,
      "content": "17.1 In supersymmetry, each fermion has a scalar partner, and each gauge boson has a\nfermionic partner. For example, the partner of the electron is the selectron (˜e), the\npartner of the muon is the smuon (˜μ), and the partner of the photon is the photino\n( ˜A). The Lagrangian gets additional terms:\nLSUSY = LSM + 1\n2(∂μ˜e + igAμ˜e)(∂μ˜e + igAμ˜e) + m2\n˜e˜e2 + g˜ee ˜A\n+ ˜A(/∂+ m ˜\nA) ˜A + 1\n2(∂μ˜μ + igAμ˜μ)(∂μ + igAμ˜μ) + m2\n˜μ˜μ2 + g˜μμ ˜A.\n(17.33)\nThe smuon and selectron have the same electric charge, −1 (here g denotes the\nelectric charge, αe = g2\n4π ∼\n1\n137). The size of the Yukawa couplings is ﬁxed to be g\nas well, by gauge invariance and supersymmetry.\n(a) Calculate the contribution of loops involving the smuon to the muon’s magnetic\ndipole moment.\n(b) The current best experimental value for g −2 of the muon is\ngμ−2\n2\n=\n11 659 208.0 ± (6.3 × 10−10). The current theory prediction (assuming the\nStandard Model only) is gμ−2\n2\n= 11 659 182.0 ± (8.0 × 10−10). What bound on\nm˜μ do you get from this measurement?\n(c) For other reasons, we expect m ˜\nA ∼m˜μ ∼m˜e ∼MSUSY. What bound on\nMSUSY do you get from the muon g −2?"
    },
    {
      "section": "18_Mass_renormalization",
      "title": "Problems",
      "page_start": 357,
      "page_end": 357,
      "content": "18.1 Scalar QED.\n(a) Calculate the self-energy graphs for a scalar in QED in dimensional regulariza-\ntion.\n(b) What are the pole mass renormalization conditions for the scalar?\n(c) What are the mass and ﬁeld strength counterterms in dimensional regularization\nin the on-shell scheme and in MS?"
    },
    {
      "section": "19_Renormalized_perturbation_theory",
      "title": "Problems",
      "page_start": 373,
      "page_end": 373,
      "content": "19.1 Evaluate the four counterterms in scalar QED at 1-loop in the on-shell scheme.\n\n19.2 Prove that Z1 = Z2 in scalar QED.\n\n19.3 Prove Yang’s theorem: a massive vector boson can never decay into two photons. For\nthe proof, you only need to consider the most general possible form the amplitude\ncould have, not any particular Lagrangian or Feynman rules."
    },
    {
      "section": "20_Infrared_divergences",
      "title": "Problems",
      "page_start": 399,
      "page_end": 399,
      "content": "20.1 Derive the phase space formula in Eq. (20.42).\n\n20.2 Calculate the Sterman–Weinberg jet rates in Eqs. (20.55) and (20.56).\n\n20.3 Calculate the total cross section for e+e−→μ+μ−(+γ) including the initial state\nradiation contribution.\n\n20.4 Calculate the cross section for e+e−→μ+μ−directly in dimensional regulariza-\ntion, without factorizing into e+e−→γ⋆and γ⋆→μ+μ−.\n\n20.5 Calculate the box and crossed box loop graphs in Eq. (20.58). Are they IR divergent?\n\n20.6 Calculate the splitting function for the QED function in Eq. (20.73)."
    },
    {
      "section": "21_Renormalizability",
      "title": "Problems",
      "page_start": 412,
      "page_end": 412,
      "content": "21.2.4 Summary\nIn summary:\n• Renormalizable theories require only a ﬁnite number of counterterms.\n• Non-renormalizable theories require an inﬁnite number of counterterms.\n• To renormalize non-renormalizable Lagrangians we must include every term not\nforbidden by symmetries.\n• Non-renormalizable theories can be renormalized. After renormalization all Green’s\nfunctions are UV ﬁnite.\n• Non-renormalizable theories are predictive at loop level, particularly through non-\nanalytic dependence on external momenta.\nFrom a practical point of view, having a ﬁnite number of counterterms and renormalization\nconditions is a huge advantage. Nevertheless, non-renormalizable theories are still very\npredictive, often more so than renormalizable ones. We discuss these issues further in the\nnext chapter through a number of Standard Model examples. Non-renormalizable theories\nplay a central role in Part IV and especially Part V of this book.\nProblems\n\n21.1 Write down all the superﬁcially divergent amplitudes in QED at 2-loops. Prove that\nall of the UV divergences can be removed with the same four counterterms required\nto remove the 1-loop divergences.\n\n21.2 Calculate the contributions of\n⃗p 4\nM 4 ,\n\u0013\n⃗p 2\nM 2 and ln2 ⃗p 2\nM 2 to a potential V(r) by taking\ntheir Fourier transforms. Which gives the strongest contribution to the potential at\nlarge distances? Which gives the weakest contribution?\n\n21.3 Write down all the renormalizable interactions for a ﬁeld theory with a single scalar\nﬁeld φ(x) in two, three, four, ﬁve and six dimensions."
    },
    {
      "section": "22_Non-renormalizable_theories",
      "title": "Problems",
      "page_start": 435,
      "page_end": 435,
      "content": "22.1 Treating the\np4\nm4 term in the Schr¨odinger equation as a perturbation, calculate its\neffects on the energy levels of the hydrogen atom in quantum mechanics. Compare\nyour result to the effect of a ln ⃗p 2\nm2 term. Which can be more easily measured?\n\n22.2 Calculate the term of order M −4 in the expansion of the 4-Fermi theory. That is,\nexpand Eq. (22.15) as in Eq. (22.16) to next order. You can use that the spinors\nare on-shell, but you should not have factors of momentum or s – any factors of\nmomentum must come from derivatives acting on the spinor ﬁelds.\n\n22.3 Verify the coefﬁcients in Eq. (22.20). Write down one correctly normalized term in\nthe expansion of each term in Eq. (22.21).\n\n22.4 In a scalar approximation to gravity, show that an interaction of the form\nL1\n1\nMPl h□2h2, as in Eq. (22.30), indeed generates an exponentially suppressed\ncontribution to Newton’s potential, as in Eq. (22.33).\n\n22.5 What is the form of the non-relativistic potential in a theory with a gφ3 interaction?\nWhy might this theory have been considered relevant as a possible theory of strong\ninteractions in the 1960s?"
    },
    {
      "section": "23_The_renormalization_group",
      "title": "Problems",
      "page_start": 469,
      "page_end": 470,
      "content": "23.1 Consider the operator O = ¯ψ/∂ψ ¯ψ/∂ψ in QED.\n(a) Evaluate the anomalous dimension of Oμν at 1-loop.\n(b) If the coefﬁcient for this operator is C = 1 at 1 TeV, what is C at 1 GeV?\n\n23.2 Show that A = 0 in Eq. (23.38) by evaluating the anomalous dimension of GF from\nEq. (23.40) in QED. At an intermediate stage, you may want to use the Fierz identity:\n\u0006 ¯ψ1PLγμγαγβψ2\n\u0007\u0006 ¯ψ3PLγμγαγβψ4\n\u0007\n= 16\n\u0006 ¯ψ1PLγμψ2\n\u0007\u0006 ¯ψ3PLγμψ4\n\u0007\n,\n(23.131)\nwhich you derived in Problem 11.8.\n\n23.3 Show that Eq. (23.97) follows from the small λR limit of the general solution to\nmR(μ).\n\n23.4 Consider a theory with N real scalar ﬁelds φi with Lagrangian\nL = −1\n2φi(□+ m2)φi −λ\n4 (φi)2(φj)2.\n(23.132)\nThis effective Lagrangian can describe systems with multiple degrees of freedom\nnear critical points (for example, the superﬂuid transition in 4He corresponds to\nN = 2).\n(a) Calculate γm and β(λR) in this theory. Check that for N = 1 you reproduce\nEqs. (23.96) and (23.95). (Note that the normalizations of λ in Eqs. (23.85)\nand (23.132) are different.)\n(b) Where is the location of the Wilson–Fisher ﬁxed point in this theory in 4 −ε\ndimensions?\n(c) What is the value of the critical exponent ν is this theory in d = 3 in the epsilon\nexpansion?\nProblems\n451\n\n23.5 Compute the value of the critical exponent ν in the Wilson–Fisher theory (with N =\n1, as in Section 23.5.2) to order ε2.\n\n23.6 Scheme dependence in the Wilson–Fisher theory.\n(a) Compute the 1-loop RGEs in scalar φ4 theory (with Lagrangian Eq. (23.85))\nusing a hard cutoff. Show that you get non-zero values for λ and m at the ﬁxed\npoint, but the critical exponent ν is the same as computed in Section 23.5.2.\n(b) Plot the RG ﬂow trajectories using the RGEs you just computed with a ﬁxed\ncutoff. What is different about these trajectories from those in Figure 23.1?\n(c) Compute the 1-loop RGEs in the Wilsonian picture by literally integrating over\na shell in momentum from bΛ to Λ. Show that you get the same value for ν.\n(d) Show that the critical exponent ν is independent of regulator and subtraction\nscheme at 1-loop. Can you choose a scheme so that λ⋆and m⋆are whatever you\nwant?\n\n23.7 Derive\nΛ d\ndΛLint(φ) =\n\u0003\nd4p (2π)4\np2 + m2\np2\nΛ2 e\np2\nΛ2\nδLint\nδφ(p)\nδLint\nδφ(−p) −\nδ2Lint\nδφ(p)δφ(−p)\n(23.133)\nusing the Wilson–Polchinski RGE. Show that the ﬁrst term corresponds to integrat-\ning out the tree-level diagram and the second from loops.\n\n23.8 Consider a theory with a dimension-2 mass parameter m2 and a dimensionless\ncoupling g.\n(a) Write down and solve generic Wilsonian RGEs for this theory, as in Eqs.\n(23.118) and (23.119).\n(b) Fix g(ΛL) = 0.1 for concreteness with ΛL = 105 GeV. What value of m2(ΛH)\nwould lead to m2(ΛL) = 100 GeV?\n(c) What would m2(ΛL) be if you changed m2(ΛH) by 1 part in 1020?\n(d) Sketch the RG ﬂows for this theory.",
      "image_path": "./figs/23_The_renormalization_group_page_470.png"
    },
    {
      "section": "24_Implications_of_unitarity",
      "title": "Problems",
      "page_start": 496,
      "page_end": 497,
      "content": "24.1 In this problem you will show how the cutting rules can be obtained directly from\ncontour integration.\n(a) Where are the poles in the integrand in Eq. (24.29) in the complex k0 plane?\n(b) Close the contour upward and write the result as the sum of two residues. Show\nthat one of these residues cannot contribute to the imaginary part of M.\n(c) Evaluate the imaginary part of the amplitude by using the other pole. Show that\nyou reproduce Eq. (24.33).\n(d) Now consider a more complicated 2 →3 process:\np1\np2\np4\np3\np5\nExplore the pole structure of this amplitude in the complex plane and show that\nthe imaginary part of this amplitude is given by the cutting rules.\n\n24.2 Derive the spectral representation for a Dirac spinor.\n\n24.3 Derive the partial wave unitarity bound for elastic scattering for a theory with\nscalars only.",
      "image_path": "./figs/24_Implications_of_unitarity_page_497.png"
    }
  ],
  "Part IV The Standard Model": [
    {
      "section": "25_Yang–Mills_theory",
      "title": "Problems",
      "page_start": 525,
      "page_end": 526,
      "content": "25.1 Check that the Yang–Mills Lagrangian in Eq. (25.6) is gauge invariant by explicitly\ninserting the transformation in Eq. (25.67).\n\n25.2 Derive Eqs. (25.20) to (25.22).\n\n25.3 Semisimplicity.\n(a) The key reason that semisimple Lie algebras are of interest in physics is that all\nﬁnite-dimension representations of semisimple algebras are Hermitian. Prove\nthis fact.\n(b) Prove that the Lorentz algebra so(1, 3) is not semisimple, but its complexiﬁca-\ntion su(2) ⊕su(2) is.\n(c) An important algebra that is not semisimple is the Heisenberg algebra. It has\nthree generators p, x and ℏsatisfying [x, p] = iℏand [x, ℏ] = [p, ℏ] = 0. Find a\nthree-dimensional matrix representation of this algebra. Show that this algebra\nis neither simple nor semisimple.\n\n25.4 Anomaly coefﬁcients.\n(a) Show that anomaly coefﬁcients for complex conjugate representations are equal\nwith opposite sign: A(R) = −A\n\u0006 ¯R\n\u0007\n. Conclude that the anomaly coefﬁcient for\na real representation is zero.\n(b) Show that for reducible representations A(R1 ⊕R2) = A(R1) + A(R2).\n(c) Show that for tensor product representations A(R1 ⊗R2) = A(R1)d(R2) +\nd(R1)A(R2).\nProblems\n507\n(d) What is A(10) for SU(4)? You can use that 4⊗4 = 6+10, with 6 being a real\nrepresentation.\n\n25.5 Check that the Noether current, Ja\nμ = g ¯ψiγμT a\nijψj + gf abcAb\nμF c\nμν, is conserved on\nthe equations of motion.\n\n25.6 Show that the path ordering is necessary in the deﬁnition of the non-Abelian Wilson\nline, Eq. (25.57), for the transformation property in Eq. (25.63) to be satisﬁed.\n(a) First show gauge invariance to leading non-trivial order in perturbation theory.\nThat is, show that the θ-functions are necessary in Eq. (25.58).\n(b) Show that the Wilson line with path ordering satisﬁes Eq. (25.63) exactly.\n\n25.7 Check that the Slavnov operator Δ, deﬁned so that φ →φ + θΔφ for the various\nﬁelds under BRST transformations, is nilpotent Δ2 = 0.",
      "image_path": "./figs/25_Yang–Mills_theory_page_526.png"
    },
    {
      "section": "26_Quantum_Yang–Mills_theory",
      "title": "Problems",
      "page_start": 552,
      "page_end": 552,
      "content": "26.1 Calculate δ3c at 1-loop in dimensional regularization by evaluating the ghost 2-point\nfunction.\n\n26.2 Work out the remaining counterterms in QCD in Feynman gauge.\n\n26.3 Colored scalars.\n(a) Compute the contribution of a color triplet scalar to δ3.\n(b) Compute the contribution of a color triplet scalar to δA3.\n(c) Compute the contribution of a color triplet scalar to the QCD β-function at\n1-loop.\n(d) Can you ﬁnd some number of scalars and/or spinors for which the 1-loop QCD\nβ-function vanishes at 1-loop?"
    },
    {
      "section": "27_Gluon_scattering_and_the_spinor-helicity_formalism",
      "title": "Problems",
      "page_start": 578,
      "page_end": 579,
      "content": "27.1 What are the explicit polarization vectors ϵμ\n± = 1\n2σμ\nα ˙αϵα ˙α\n± when pμ = (E, 0, 0, E)\nand rμ = (1, 0, 0, 1)? What would you choose rμ to be so that ϵμ = (0, 1, 0, 0) when\npμ = (E, 0, 0, E)?\n\n27.2 Verify that the color-stripped amplitudes and Parke–Taylor formula reproduce the\ngg →gg scattering cross section by using Eqs. (27.84) and (27.88) and adding the\nappropriate color factors.\n\n27.3 Prove the general formula for the matrix element in terms of color-ordered partial\namplitudes, Eq. (27.84).\n\n27.4 Compute the Compton scattering cross section, γe−→γe−, in the high-energy\nlimit using helicity spinors. Check that you reproduce Eq. (13.141).\n\n27.5 Calculate |M|2 summed over spins and colors for the remaining 2 →2 processes in\nQCD. Fill out the following table:\n560\nGluon scattering and the spinor-helicity formalism\nProcess\n\u0002 |M|2/g4\ns\nProcess\n\u0002 |M|2/g4\ns\nq¯q →q′¯q′\n4\n9\nt2+u2\ns2\ngg →gg\n9\n3(3 −tu\ns2 −su\nt2 −st\nu2 )\nqq′ →qq′\nq¯q →gg\nq¯q′ →q¯q′\ngq →gq\nqq →qq\ngg →q¯q\nq¯q →q¯q\nwhere q and q′ refer to quarks of different ﬂavor. The two entries shown come from\nEqs. (13.68) and (27.74).\n\n27.6 Calculate the |M|2 summed over spins and colors for the process gg →ggg.\n\n27.7 Prove the Parke–Taylor formula using BCFW recursion relations. If you do a couple\nof cases (5-, 6- or 7-point amplitudes) you should see the pattern and the proof should\nbe straightforward.\n\n27.8 In the proof of the Jacobi identity using factorization in Section 27.5.2, we chose a\nparticular pole, P 2 = 0, in the t-channel by taking [14] = 0 or ⟨14⟩= 0. Since\nP 2 = ⟨23⟩[32] = ⟨14⟩[41] one also must choose ⟨23⟩= 0 or [23] = 0. Can you\nderive any additional constraints on the form of the amplitude from considering all\nfour possible combinations, such as ⟨23⟩= [14] = 0 or ⟨23⟩= ⟨14⟩= 0?",
      "image_path": "./figs/27_Gluon_scattering_and_the_spinor-helicity_formalism_page_579.png"
    },
    {
      "section": "28_Spontaneous_symmetry_breaking",
      "title": "Problems",
      "page_start": 602,
      "page_end": 602,
      "content": "28.1 Show that writing φ(x) =\n\u0013\n2m2\nλ + ˜φ(x) for the linear sigma model in Section 28.2.1\nleads to a mass matrix with zero eigenvalue. Show that when a linear combination of\nthe two real ﬁelds in the complex ﬁeld ˜φ is chosen to diagonalize the mass matrix,\nthe expansion in Eq. (28.12) results.\n\n28.2 Work out the transformations to order π2 and θ2 in Eq. (28.25) using the Baker–\nCampbell–Hausdorff lemma:\nexp(A) exp(B)\n= exp\nA + B + 1\n2[A, B] + 1\n12[A, [A, B]] −1\n12[B, [A, B]] + · · ·\n. (28.72)\nShow that pions transform in the adjoint representation under isospin.\n\n28.3 Work out the interaction terms of order π3 in the gauged nonlinear sigma model in\nEq. (28.59).\n\n28.4 Consider a theory with n real scalar ﬁelds and Lagrangian L = −1\n2φi(□−m2)φi +\nλ\n4 (φiφi)2.\n(a) What are the global symmetries of this theory?\n(b) What are all the possible vacua of this theory? Are all the vacua equivalent?\n(c) Write down the Lagrangian for small excitations around one of the vacua. How\nmany Goldstone bosons are there?\n\n28.5 For grand uniﬁcation based on SU(5) to work, there must be a potential for the 24\nscalar ﬁelds Φa such that Φ = Φaτ a has a minimum in the form of Eq. (28.55).\nConsider the most general SU(5)-invariant potential for Φ:\nV = −m2tr(Φ2) + a tr(Φ4) + b\n\u0004\ntr(Φ2)\n\u00052 .\n(28.73)\nOne can always choose a basis where ⟨Φ⟩\n=\nv diag(a1, a2, a3, a4, a5) with\n\u0002\ni ai = 0.\n(a) For what values of m2, a and b is ⟨Φ⟩= v diag(2, 2, 2, −3, −3) an extremum?\n(b) Show that excitations around ⟨Φ⟩= v diag(2, 2, 2, −3, −3) all have non-\nnegative mass-squared.\n(c) Find all possible minima for this potential. This is easiest if you impose the\ntracelessness condition with a Lagrange multiplier.\n(d) For the minimum of the form ⟨Φ⟩= v diag(1, 1, 1, 1, −4), what are the masses\nof the massive gauge bosons, and what is the unbroken gauge group?"
    },
    {
      "section": "29_Weak_interactions",
      "title": "Problems",
      "page_start": 633,
      "page_end": 634,
      "content": "29.1 The dominant production mechanism for Higgs bosons at LEP was e+e−→ZH.\nCalculate the total cross section for this process at tree-level in the Standard Model.\nHow many 100 GeV Higgs bosons would there have been when LEP ran at\n206 GeV?\n\n29.2 e + e−→hadrons in the Standard Model.\n(a) Calculate the rate for the total cross section σtot(e + e−→hadrons) in the\nStandard Model at tree-level including both Z-boson and photon contributions\nand their interference. The contribution using photons alone was calculated in\nSection 26.3.\n(b) Calculate σtot at 1-loop.\n(c) Plot the total cross section as a function of center-of-mass energy showing sepa-\nrately the photon contribution, the Z-boson contribution, and their sum. Plot also\nthe sum ignoring interference between the Z-boson and photon contributions.\nWhen can interference be ignored?\n\n29.3 Higgs decays.\n(a) Calculate the rate for H →b¯b in the Standard Model.\n(b) Calculate the rate for H →gg in the Standard Model. The dominant contribu-\ntion to this comes from a triangle loop diagram involving top quarks.\n(c) Calculate the rate for H →γγ in the Standard Model. Include contributions\nboth from top loops and from loops of W bosons.\n(d) Plot the branching ratios for H →b¯b, H →gg and H →γγ as a function of\nHiggs mass.\n\n29.4 Partial wave unitarity.\n(a) Calculate the matrix element for longitudinal W +\nL W −\nL →W +\nL W −\nL scattering in\nthe Standard Model.\n(b) Show that the high-energy behavior of this matrix element is reproduced using\nthe Goldstone boson equivalence theorem.\nProblems\n615\n(c) Does this give a stronger unitarity constraint than the one using W +\nL ZL →\nW +\nL ZL scattering?\n\n29.5 Figure 29.2 includes a number of experimental constraints on the CKM matrix.\n(a) The parameter εK is what we were calling ϵ in Section 29.5.2. Why do the\ncurves marked εK have the shape they do? That is, what combination of CKM\nelements is εK sensitive to?\n(b) What could you measure to produce the curves marked Δmd or |Vub|?\n\n29.6 Show that with general Dirac and Majorana mass matrices, there are three phases in\nthe PNMS matrix, while if the mass matrix is purely Dirac, there is only one. How\nmany phases are there if the masses are purely Majorana?\n\n29.7 Neutrino oscillations.\n(a) Neutrinos are produced in the Sun predominantly through the reaction p + p +\ne−→d + νe. What is the momentum of the neutrinos produced this way?\n(b) Consider a two-neutrino ﬂavor system. The mass eigenstates evolve in time as\n|ν1⟩= e−iE1t\u0016\ncos θ|νe⟩+ sin θ|νμ⟩\n\u0017\n,\n(29.117)\n|ν2⟩= e−iE2t\u0016\n−sin θ|νe⟩+ cos θ|νμ⟩\n\u0017\n,\n(29.118)\nwhere θ is the mixing angle. Show that the probability of ﬁnding a solar neutrino\nas an electron neutrino after a time T is given by\nP = 1 −sin2(2θ) sin2 (E2 −E1)T\n2\n.\n(29.119)\n(c) Take the non-relativisitic limit E ≫mν to show that the probability of ﬁnding a\nsolar neutrino with energy E as an electron neutrino at a distance L is given by\nP = 1 −sin2(2θ) sin2 Δm2L\n4E\n.\n(29.120)\n(d) How far should you put your detector from a reactor producing ∼4MeV\nneutrinos assuming Δm2 = 7.5 × 10−5 eV2 to see the largest effect?\n\n29.8 Show that when you integrate out the right-handed neutrinos in Eq. (29.63), a\ndimension-5 operator like that in Eq. (29.65) results. What is the exact relationship\nbetween Mij and 7\nMij?\n\n29.9 Show that when multiple generations are rotated, then the θ angle shifts by\narg det\n\u0006\nR†L\n\u0007\n.",
      "image_path": "./figs/29_Weak_interactions_page_634.png"
    },
    {
      "section": "30_Anomalies",
      "title": "Problems",
      "page_start": 659,
      "page_end": 659,
      "content": "30.1 Baryon number has an anomaly so that ∂μJB\nμ ̸= 0 as in Eq. (30.88). Since the right-\nhand side of Eq. (30.88) has more than two gauge ﬁelds, it implies that diagrams\nsuch as\nwith the\nindicating JB\nμ (x), should also give non-zero answers when contracted\nwith ∂μ. Evaluate this diagram and any other that contributes at the same order to\nshow that the W 3 terms in Eq. (30.88) are correctly reproduced.\n\n30.2 For which types of neutrino masses (Majorana, Dirac or both) is lepton number\nanomalous? For which types of masses is B −L anomalous?\n\n30.3 Suppose that QCD were based on the gauge group SU(5). Let us assume that the\nproton still exists as a ﬁve-quark bound state with charge +1, so that quarks now have\nﬁve colors and electric charges in Z/5. What values for the SU(5) × SU(2)weak ×\nSU(1)Y quantum numbers of the Standard Model ﬁelds would make this universe\nanomaly free?\n\n30.4 Can anomaly matching arguments determine if SU(4)L × SU(4)R is spontaneously\nbroken in QCD?"
    },
    {
      "section": "31_Precision_tests_of_the_Standard_Model",
      "title": "Problems",
      "page_start": 685,
      "page_end": 685,
      "content": "31.1 Calculate the rate for μ−→e−¯νeνμ at tree-level in the 4-Fermi theory and verify\nEq. (31.3).\n\n31.2 Another well-measured quantity is the decay rate of the Z boson into leptons,\nΓe+e−≡Γ (Z →e+e−). At tree-level,\nΓ(Z →e+e−) =\nv\n96π\ne3\ns3c3\n%\n1\n4 +\n2s2 −1\n2\n2&\n.\n(31.129)\nThe current experimental value is Γe+e−≡Γ(Z →e+e−) = 83.99 ± 0.18 MeV.\n(a) Evaluate the tree-level prediction for Γe+e−. How many standard deviations is\nthe result off from the experimental value?\n(b) Derive an expression for Γe+e−at 1-loop in terms of MS Lagrangian parameters.\n(c) Derive an expression for Γe+e−in terms of vacuum polarization graphs.\n(d) Evaluate Γe+e−numerically at 1-loop. How does your answer compare to the\nexperimental value?\n\n31.3 Calculate the Higgs boson contributions to the various vacuum polarization graphs\nexactly. Verify the leading behavior in Eqs. (31.68) and (31.69).\n\n31.4 Flavor-changing b decays:\n(a) Calculate the rate for b →sγ in the Standard Model. The relevant graphs have\nthe photon coming off a W-boson loop.\n(b) Match to an effective theory at tree-level so that the b →sγ rate is reproduced.\n(c) Evaluate the order αs corrections to the effective theory.\n(d) Evolve the operator from mW to mb. How big are the radiative corrections to\nthis decay rate from QCD?"
    },
    {
      "section": "32_Quantum_chromodynamics_and_the_parton_model",
      "title": "Problems",
      "page_start": 717,
      "page_end": 719,
      "content": "32.1 Derive an expression for the mean charge radius ⟨r2⟩=\n!\nd3x r2ρ(x) in terms of\na form factor F\n\u0006\nq2\u0007\nby expanding F\n\u0006\nq2\u0007\n=\n!\nd3x ei⃗q·⃗xV (x) around x = 0. What\nis the mean charge radius of the proton from Eq. (32.9)?\n\n32.2 Show that the PDFs, as classical probabilities, should satisfy \u0002\nj\n!\ndx xfj(x) = 1,\nas in Eq. (32.29). [Hint: consider the average momentum for each parton.]\n\n32.3 Derive the expansion in Eq. (32.38). One way to do this is to write\n\u0003 1\n0\ndx x−1+εf(x) =\n\u0003 1\n0\ndx x−1+εf(0)+\n\u0003 1\n0\ndx x−1+ε [f(x) −f(0)] (32.118)\nand to evaluate the ﬁrst term and Taylor expand the second term.\n\n32.4 Evaluate the relationship between W1 and W2 that would result instead of the\nCallan–Gross relation if quarks were scalars. How could you test this prediction?\n\n32.5 Calculate the g →gg splitting function by taking the collinear limit of gg →gg\nscattering. You can use the cross section calculated in Chapter 27.\n\n32.6 Find the limits of integration on z for t = p2\nT in the process γ⋆→q¯qg discussed\nin Section 32.3. Then calculate P(t) and the Sudakov factor Δ(Q, t) explicitly.\nRepeat the exercise for t = m2 and t = θ. Which part of the Sudakov factor is\nuniversal?\n\n32.7 In this problem, you will show that Q →∞at ﬁxed ω = 2P ·q\nQ2 or equivalently ﬁxed\nχ ≡2mp\nω\nimplies that J(xμ)J(0) is dominated by the lightcone, where x2\nμ →0.\n(a) In the proton rest frame, show that\nqμxμ = ωQ2\n2mp\n(x0 −r) −mp\nω r + O\n1\nQ2\n,\n(32.119)\nwhere r ≡⃗q·⃗x\n|⃗q| .\n(b) Use the method of stationary phase to show that at ﬁxed ω, W μν, in the form\nof Eq. (32.78), is dominated by\nx0 −r\n≤\nc1\nQ2 and r ≤c1 for two constants\nc1 and c2 as Q →∞.\n(c) Show that x2 ≤const\nQ2 and therefore that J(xμ)J(0) is dominated by lightlike\nseparations in the DIS limit.\n\n32.8 Relating imaginary parts to discontinuities. The goal of this problem is to verify\nEq. (32.83).\n(a) By expanding the time ordering in terms of θ(t) and θ(−t) show that T μν as\nin Eq. (32.81) can be written as\nTμν(ω, Q) =\nX\n(2π)3δ3(⃗pX −⃗q −⃗P)\np0\nX −p0 −q0 −iε\n⟨p+|Jμ(0)|X⟩⟨X|Jν(0)|p+⟩\n+\nX\n(2π)3δ3(⃗pX + ⃗q −⃗P)\np0\nX −p0 + q0 −iε\n⟨p+|Jμ(0)|X⟩⟨X|Jν(0)|p+⟩.\n(32.120)\nYou may want to use θ(t) =\n1\n2πi\n! ∞\n−∞\nds\ns−iεeist.\nProblems\n699\n(b) Use part (a) to show that one of the terms above does not contribute to the\ndiscontinuity in the physical region and that Wμν = −i Disc Tμν.\n\n32.9 Show that current conservation implies a sum rule for each ﬂavor in QCD using\nspin-1 operators in the OPE, as we did for spin 2 in Section 32.4.4.\n\n32.10 Show that p2\nT =\nˆsˆtˆu\n(ˆs+Q2)2 and verify Eq. (32.58).\n\n32.11 Relate the lightcone PDF deﬁnition from Eq. (32.117) to the Mellin moments\nfrom Section 32.4.4.\n(a) Compute the m = 1 moment of the lightcone PDF deﬁnition to show that you\nget the matrix element of the spin-1 operator ˆOμ\nq = ¯ψγμψ. Be careful with the\nlimits of integration.\n(b) Show that you can reproduce the matrix elements of the twist-2 spin-m\noperators by taking moments.\n(c) Can you construct the lightcone PDF deﬁnition from the Mellin moments?",
      "image_path": "./figs/32_Quantum_chromodynamics_and_the_parton_model_page_719.png"
    }
  ],
  "Part V Advanced topics": [
    {
      "section": "33_Effective_actions_and_Schwinger_proper_time",
      "title": "Problems",
      "page_start": 751,
      "page_end": 751,
      "content": "33.1 Complete the calculation of the Euler–Heisenberg Lagrangian using Landau levels\nin an arbitrary Fμν. Show that for an electric ﬁeld B →iE is justiﬁed. Also show\nthat the result for a general electromagnetic ﬁeld is given by Eq. (33.71).\n\n33.2 Calculate light-by-light scattering using helicity spinors.\n\n33.3 Calculate the contour integral to derive the pair-production rate Eq. (33.94) from\nEq. (33.93). It is helpful to ﬁrst expand the integration limits to\n! ∞\n−∞ds, then deform\nthe contour to pick up the poles.\n\n33.4 Repeat the analysis in Section 33.6.1 for a fermion. Show that in the non-relativistic\nlimit, the spin is irrelevant.\n\n33.5 Show that the eigenvalues of Fμν are given by Eq. (33.A.166)."
    },
    {
      "section": "34_Background_fields",
      "title": "Problems",
      "page_start": 777,
      "page_end": 778,
      "content": "34.1 W[J] as the generating functional of connected diagrams.\n(a) Take the third variational derivative of W[J] to show that it gives only the\nconnected contributions to the 3-point function.\n(b) Show that W[J] does generate all the connected diagrams for any n-point\nfunction.\nProblems\n759\n\n34.2 General scalar effective potential.\n(a) Calculate the contribution of a fermion to the scalar potential starting with the\nLagrangian L = −1\n2φ□φ −V (φ) + i ¯ψ/∂ψ −Y φ ¯ψψ.\n(b) Show that the general 1-loop effective potential is given by\nVeff(φ) = V (φ) +\ni\n(−1)2si\nni\nd\n64π2 m4\ni (φ) ln m2\ni (φ)\nφ2\nR\n,\n(34.106)\nas in Eq. (34.66), where si is the spin and ni\nd is the real number of degrees of\nfreedom on-shell for a given particle.\n\n34.3 Calculate the Coleman–Weinberg potential in scalar QED and verify Eq. (34.71).\n\n34.4 Calculate the W- and Z-boson contributions to the Higgs effective potential.\n\n34.5 Improve the Higgs stability bound in the Standard Model.\n(a) Show that including the SU(2) × U(1) gauge ﬁelds, you get\nVeff(h) = −m2h2 + λ\n4 h4\n+\n9\n64π2 λ2 −\n3\n64π2 Y 4\nt + 3\n8g4 + 3\n16(g2 + g′2)\nh4 ln h2\nv2 .\n(34.107)\n(b) Plug in the Standard Model values for g and g′ and see how the lower bound on\nthe Higgs mass changes.\n(c) Calculate βλ = μ d\ndμλ and γ2 = μ d\ndμh including top and Higgs correction in the\nStandard Model.\n(d) Solve the RGEs from the previous part to get an RG-improved effective\npotential.\n(e) What is the lower bound on the Higgs mass for absolute stability using this\nRG-improved potential?\n\n34.6 Calculate the coefﬁcient of the A4 vertex in the 1PI effective action using the\nbackground-ﬁeld method.\n\n34.7 Calculate the fermion contributions to the QCD β-function using the background-\nﬁeld method.\n\n34.8 Background-ﬁeld effective action.\n(a) Calculate the ﬁnite parts of the vacuum polarization loops from Section 34.3.2\nin background-ﬁeld gauge. You should ﬁnd that the ﬁnite parts are in fact ξ$\ndependent. For example, the contribution at order ξ$2 comes only from the graph\nin Eq. (34.97)\n(b) Why is it OK for the ﬁnite parts to have ξ$ dependence, but not the divergent\nparts?",
      "image_path": "./figs/34_Background_fields_page_778.png"
    },
    {
      "section": "35_Heavy-quark_physics",
      "title": "Problems",
      "page_start": 794,
      "page_end": 794,
      "content": "35.1 Reparametrization invariance.\n(a) Show that the HQET Lagrangian including the leading m−1\nQ\ncorrections, Eq.\n(35.72), is invariant under\nvμ →vμ +\n1\nmQ\nkμ,\nQν →eik·x\n1 +\n/k\n2mQ\nQv,\n(35.81)\nwith v·k = 0 and k ≪mQ. This transformation is known as reparametrization\ninvariance. It corresponds to the arbitrariness in the choice of vμ.\n(b) Use reparametrization invariance to show that the Qv\nD2\n2mQ Qv term in the HQET\nLagrangian cannot be renormalized separately from the Qvv · DQv term.\n(c) Conﬁrm through a direct 1-loop calculation that these two terms are indeed\nrenormalized in the same way.\n\n35.2 Calculate the anomalous dimension of the HQET operator\ng\n4mQ QvσμνQvF μν at\n1-loop."
    },
    {
      "section": "36_Jets_and_effective_field_theory",
      "title": "Problems",
      "page_start": 829,
      "page_end": 831,
      "content": "36.1 Show that in the dijet region τ ≈τ1. In particular, show that the singular terms in\ndσ\ndτ are the same as the singular terms in dσ\ndτ! for any number of particles.\n\n36.2 Collinear factorization.\n(a) Show that the collinear factorization in Eq. (36.51) holds for multiple emissions\nin scalar QED.\n(b) Show that the collinear factorization in Eq. (36.43) holds for multiple emissions\nin QCD.\n\n36.3 Calculate the g →gg splitting function from the matrix element of gluon jet ﬁelds\nfollowing the approach in Section 36.4.2. Average over azimuthal angle, you should\nﬁnd Pgg = 2CA\n\u0018\nz\n1−z + 1−z\nz\n+ z(1 −z)\n\u0019\n, as in Eq. (32.54).\n\n36.4 Show soft-collinear factorization at leading power for two emissions in scalar QED.\nThat is, show that\n⟨Ω|φ⋆\n1φ2|p1p2; q; k⟩∼⟨Ω|φ⋆\n1W1|p1; q⟩⟨Ω|W †\n2 φ2|p2⟩⟨Ω|Y1Y †\n2 |k⟩,\n(36.135)\nwhere pμ\n1 and pμ\n2 are the momenta of the scalars, kμ is the momentum of a soft\nphoton and q is the momentum of a photon collinear to p1.\n\n36.5 Calculate the quark self-energy graph at 1-loop in lightcone gauge. Show that the\nimaginary part gives the same jet function as computed in Section 36.6.2.\n\n36.6 Threshold Drell–Yan.\n(a) Show that near partonic threshold, the Drell–Yan cross section can be written as\ndσ\ndM 2 =\n4πα2Q2\nq\n3NM 2√s|C|2\n\u0003 dξ1\nξ1\ndξ2\nξ2\nf(ξ1) f(ξ2) ˆWDY\n\u0006√s(1 −z)\n\u0007\n, (36.136)\nwhere\nˆWDY(ω) =\n\u0003\ndt\n4π e\ni\n2 ωx0WDY\n\u0016\nx0,⃗0\n\u0017\n.\n(36.137)\n(b) Compute the Wilson coefﬁcient C for Oμ in Eq. (36.73) at order αs.\n(c) Calculate WDY(x) and ˆWDY(ω) to 1-loop.\nProblems\n811\n\n36.7 Laplace transforms are extremely useful for solving RGEs in SCET. We deﬁne the\nLaplace transform of a function f(τ) as\n˜f(ν) ≡\n\u0003 ∞\n0\ndτe−ντf(τ).\n(36.138)\n(a) Show that the cross section in Eq. (36.101) simpliﬁes to\n˜σ(ν) = H˜j(ν)2˜sT (ν)\n(36.139)\nin Laplace space.\n(b) Show that the RGE for the jet function in Eq. (36.127) simpliﬁes to\nμ d\ndμ\n˜j(ν, μ) = αs(μ)\n−2ΓJ ln\nQ2\neγEνμ2 −2γJ\n˜j(ν, μ) .\n(36.140)\nWhat are ΓJ and γJ? Find a similar RGE for the Laplace-transformed soft\nfunction.\n(c) Solve the RGE for the jet function in Laplace space and show that the result, in\nposition space, is as in Eq. (36.128).\n\n36.8 Sukakov RGEs.\n(a) Verify that Eq. (36.124) solves Eq. (36.123).\n(b) Show that the function S(ν, μ) in Eq. (36.126) has the expansion\nS(ν, μ) =\nπCF\nβ2\n0αs(ν)\n1 −αs(μ)\nαs(ν) −ln αs(μ)\nαs(ν) + O(αs)\n.\n(36.141)\n(c) Find a similar expansion for AH(ν, μ).",
      "image_path": "./figs/36_Jets_and_effective_field_theory_page_831.png"
    }
  ],
  "Appendices": [
    {
      "section": "Appendix_A_Conventions",
      "title": "Problems",
      "page_start": 840,
      "page_end": 840,
      "content": "A.1 Dimensional analysis.\n(a) A photon coupled to a complex scalar ﬁeld in d dimensions has action\nS =\n\u0003\nddx\n−1\n4F 2\nμν −φ⋆□φ + gAμφ⋆∂μφ + λφ3 + · · ·\n,\n(A.52)\nwhere Fμν =(∂μAν−∂νAμ) and □= ∂μ∂μ as always, but now μ = 0, 1, · · · , d−1.\nWhat are the mass dimensions of Aμ, φ, g and λ (as functions of d)?\n(b) An interaction is said to be renormalizable if its coupling constant is dimension-\nless. In what dimension d is the electromagnetic interaction renormalizable? How\nabout the φ3 interaction?"
    },
    {
      "section": "Appendix_B_Regularization",
      "title": "Problems",
      "page_start": 852,
      "page_end": 852,
      "content": "B.4.3 Other regulators\nThere are several other regulators that are sometimes used:\n• Hard cutoff: kE < Λ. This breaks Lorentz invariance, and usually every symmetry in\nthe theory, but is perhaps the most intuitive regularization procedure.\n• Point splitting. Divergences at k →∞correspond to two ﬁelds approaching each other\nx1 →x2. Point splitting puts a lower bound on this, |xμ\n1 −xμ\n2| >|ϵμ|. This also breaks\ntranslation invariance and is impractical for gauge theories, but is useful in theories with\ncomposite operators.\n• Lattice regularization. Although a lattice breaks both translation invariance and Lorentz\ninvariance, it is possible to construct a lattice such that translation and Lorentz invariance\nare restored in the continuum limit (see Section 25.5).\nProblems\n\nB.1 Show that the Wick rotation still works if Δ < 0."
    }
  ]
}